[{"title":"对赌天气跨界营销","date":"2017-04-09T10:13:08.000Z","path":"2017/04/09/对赌天气跨界营销/","text":"Alan Perry是美国北卡州Wilmington一家小珠宝店的老板。 2010年冬天，他推出了一个很有趣的促销活动： 如果在感恩节之后的2个星期里，你在店里买了珠宝。圣诞节当天，假如北卡另外一个小镇Asheville（距离Wilmington500公里左右）圣诞节当天下雪超过3英寸，珠宝留着，钱全退，全退！ 这个消息一下就在附近传开了，甚至Asheville的当地居民也专门驱车500多公里来这家珠宝店买珠宝，一时间门庭若市，销售大涨！ 结果圣诞节当天，极少下雪的Asheville竟然下了6英寸的厚雪，小店前排满了申请全额退款的人，Alan Perry二话没说，珠宝保留，全额退款，当天退了40多万美金。 Perry失算了？要破产了？独自一个人流泪到天亮？ 错! Small pain, large gain: Perry bought a weather-based insurance policy from his longstanding insurer Global Weather Insurance. 因为这位Perry老板根据自己那段时间的销售额购买了天气保险。 这种保险方式原本是要让一些「靠天吃饭」的商家在使用的，譬如卖伞的小店主，每个月要下十五天以上的雨天才能获利，阿婆可买一份「15天以上会下雨」的保单，假如真的下雨不超过十五日，就会获赔一笔足以平摊她生意损失的费用。 这位老板充分利用这种气象保险，借助这种极富传播力的趣味活动，绕开了打折送赠品之类的老套促销手段，达到了提升销售、提升知名度的目的。 这位老板后来变本加厉，搞出了“结婚当天如果下雨婚戒免费”等活动 ，都有效地提升了销售，没有降低利润率。 对于金银首饰珠宝这种同质化竞争很强的产品，如果依赖老套的打折、赠品等方式，是很难在不降低利润率的前提下获得销售增长的，营销人的真正实力，在这种同质化竞争市场上体现得最为明显。这位Perry老板，通过对赌天气这种趣味跨界营销活动，通过保险对冲其风险，大大提升了自己店铺的知名度，最后连CNN的新闻都报道了他的促销活动（文章来源：Six inches of snow gets free jewelry for 311 lucky shoppers），免费给他做了一次广告，生意涨得一发不可收拾。 (文章来源:https://www.zhihu.com/question/20431221/answer/145301562)","tags":[{"name":"营销","slug":"营销","permalink":"http://yoursite.com/tags/营销/"}]},{"title":"5个技巧避免不必要的浏览器兼容性问题","date":"2017-04-09T02:22:07.000Z","path":"2017/04/09/5个技巧避免不必要的浏览器兼容性问题/","text":"","tags":[]},{"title":"如何查询每一个栏目下价格最高的商品?","date":"2017-04-09T01:50:31.000Z","path":"2017/04/09/如何查询每一个栏目下价格最高的商品/","text":"假设有下面这样一张表：我们要用MySQL查询出每个栏目下最贵的那一个商品。 查询的结果在内存中可以当做一张表来看待，可以对这张表进行再次查询，具体细节如下图所示：","tags":[{"name":"数据库","slug":"数据库","permalink":"http://yoursite.com/tags/数据库/"}]},{"title":"笔记CSS-01","date":"2017-04-09T01:43:12.000Z","path":"2017/04/09/CSS笔记01/","text":"1.给&lt;img&gt;标签的alt属性添加让人一听或者一看就能明白的内容。2.搜索引擎会将&lt;h1&gt;视为仅次于&lt;title&gt;标签的另一个搜索关键词的来源。3.几乎所有元素的display属性值要么为block，要么为inline。最明显买的一个例外是table元素，他有自己特殊的display属性值！4.无论你想了解哪一个html元素，第一个要问的问题都应该是：它是块级元素还是行内元素。5.块级元素盒子会扩展到与父元素同宽，行内元素盒子会“收缩包裹”其内容，并且会尽可能抱紧。6.blockquote元素会默认缩进。7.&amp;ldquo和&amp;rdquo，使用这两个引号的实体，能让页面显得更加专业。8.用HTML来构建DOM，最后使用CSS来修改DOM。9.h1,h2,h3{color:blue}把三个选择符组合在一起，就可以减少重复输入。（如果你想在后面单独为h3应用一条规则，在后面添加即可）10.上下文选择符是以空格作为分隔，而分组选择符是以逗号作为分隔。11.p*{color:red;}这样会把p包含的所有元素的文本变为红色。section *a{color:red;}任何是section的孙子元素，而非子元素的a标签都会被选中。至于a的父元素是什么，没有关系。12.没有默认样式的span，由于我们没有明确为其添加样式，所以就继承了其父元素的样式。13.ID也可以用在页内的导航链接中，目标是同一页的另一个位置。14.ID值得唯一性对js尤其重要，否则就会导致js行为异常。15.类的目的是为了标识一组具有相同特征的元素。类可以应用给任意多个页面中任意多的HTML元素的公共标识符，以便我们为这些元素应用想用的样式。16.继承和上下文选择符能让不同的标签共享样式，从而降低你需要编写和维护的css的量。","tags":[{"name":"CSS","slug":"CSS","permalink":"http://yoursite.com/tags/CSS/"}]},{"title":"背影-幼年时代","date":"2017-04-09T01:03:49.000Z","path":"2017/04/09/背影-幼年时代/","text":"前两天陪老妈回老家送奶奶回家,感觉自己还是没有长大,还是那个无知的自己,总是不加思考的把自己的愤怒丢给了自己最亲的人,总是在应该道歉的时候失去了勇气,总是无法控制自己的懒惰,总是喜欢空想虚无缥缈的未来而时常怀疑自己脚踏实地的坚持是否真的能到达理想的彼岸… 今天我想静一静,回头看一看以前走过的路. 幼年时代 关于幼年时的记忆并不多,但若是从现在的角度看过去,还是能够擦除记忆里的尘埃,让我看到的东西多了那么一点点. 我的家乡是安徽省临泉县的一个小村庄,我喜欢的一个女孩好像非常介意我是不是河南人,我告诉她我家门口有一条大河,河的对面就是河南,直到今年回家我才知道原来我所理解的河南其实并不是河南,这个河南应该理解为河的南面,也就是说河的对面其实也是安徽省. 这个小村庄只有世代住在那里的为数不多的几十户人家,为什么要说这个呢,因为三岁便离开家乡的我如今二十岁重返家乡在我不认识任何一个人的情况下依然有人知道我是当年那个三岁便离开家乡的小孩.这次回老家我看见的一个非常漂亮的姑娘,只见了三次我便深深的记住了她,如果我已经毕业了我一定会追求这个姑娘,如果等到我毕业了这个姑娘或许已经嫁人了吧?希望等我毕业回到家乡还能够再见到她,哪怕能说上一句话也好. 家乡的路是一下雨就走不成的那种,所以村里人最常用也是最贵重的交通工具就是一辆充电就能跑的小三轮车,这次回老家二妈带着我去赶集,一路十里地的颠簸让快散架的我发现了这种小车的性能是如此的健壮,在以前没有交通工具的年代,爸妈都是走上十里地去赶集,老妈告诉我虽然以前他们都是地下走着去赶集,但是他们并不觉得累,因为那个时候还没有出去打工的概念,所以家乡的人很多,而赶集便是最热闹的时候,一到那天男女老少一路边走变唠,到集上去看戏,去看电影,去买日常的用品.当老妈给我告诉我这件事的时候,我看到了似曾相识的笑容,那笑容我只在小朋友的脸上看到过. 关于我小时候的记忆,大多数都是来自于老妈.不知道什么时候,我发现天下所有的母亲都喜欢把自己的孩子拿来夸耀,从母亲的口中听到的关于我的印象最深刻的一件事就是,有一天她和老爸都不在家,当时只有三岁的我一边照看着比我小一岁的妹妹不让她乱跑,一边照看着家里面的小鸡,不让小鸡乱跑… 而在我自己的记忆中,我知道家门前有一条大河,好大好大,我知道有一次我大便拉出来一条好长的虫子,不过我不知道这件事到底是事实还是只在我的梦里出现过. 在我三岁的时候,老爸便带着我们一家来到了新疆,之所以想离开家乡是因为如果继续待在老家我们家是连饭的没的吃的.从我的老家到新疆现在要62个小时,很难想象在当时的交通环境下压在老爸肩上的担子是多么的重.","tags":[{"name":"人生","slug":"人生","permalink":"http://yoursite.com/tags/人生/"}]},{"title":"找最小值和下标20170330","date":"2017-03-30T06:22:58.000Z","path":"2017/03/30/找最小值和下标20170330/","text":"我们要找的是在一个数组中最小的一个值和它的位置,如果你上来直接排序的话,这个时候最小值的位置就改变了,所以我们不能采取先排序再找位置的策略. var arr = [34,71,8,934,10]; var value = 999; var index = -1; for(var i = 0; i &lt; arr.length; i++){ if( arr[i] &lt; value){ value = arr[i]; index = i; } } alert(&apos;min:&apos;+value + &apos; index:&apos; +index); 输出结果为:min:8 index:2","tags":[{"name":"算法","slug":"算法","permalink":"http://yoursite.com/tags/算法/"}]},{"title":"《一流人才思考习惯》","date":"2017-03-29T16:37:04.000Z","path":"2017/03/30/《一流人才思考习惯》/","text":"我们常说习惯决定命运这句话不是没有道理的，本书的作者高妻荣是一名运动教练，她用她自己多年的经历告诉你一流的运动运是如何思考的，又是如何行动的，虽然这些优秀的习惯来自于运动员，但是这种共通的“思考习惯”，对于任何领域的一流人才来说都是通用的，就算你现在不具备这种取得成就的资质，只要你改变自己的思考方式，你照样能将这种宝贵的资质据为己有。 一：每天的习惯总有自己执着的事；脸上永远不会缺乏笑容；每天都不忘记早餐；精神百倍的与人打招呼；每天都做同样的事；特别注重平衡；心智坚定无法动摇。 二：采取行动时的习惯总会想象自己成功的时候的样子；从不会忘记检查自己的计划表；总会通过反推来分析事物；总是惜时如金。三：为了将实力发挥到最佳的习惯控制自己的心态；总是执着于自己所关注事情的某一点；靠着呼吸来调节自己的情绪；保持着最挺拔的身姿；能灵活划分“紧张”和“松弛”；就算在逆境中也不轻言放弃；不会在意旁人的说法；不会过分在意成就；利用对手来让自己强大；总是能开心开始，开心结束。 四：被任务追着跑时的习惯把压力当做朋友；善于苦衷做乐；从不多想；永不消沉；不会满足于简单的反省；好胜；对成功体验有特别的执著。 五：为磨练自我而形成的习惯不会忘记初衷；善于“偷师”；在人看不见的地方偷偷地努力；拥有有别于他人的享乐方式。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"《明朝一哥王阳明》","date":"2017-03-29T16:31:29.000Z","path":"2017/03/30/《明朝一哥王阳明》/","text":"第一次知道王阳明是在当年明月的《明朝那些事》里，这是读的第二本关于王阳明的书，没有读完，知识略读了一下，感觉写的不是很好，当然如果你没有细看，第一眼看上去这屎的不能再屎的排版也会让你放弃想读的欲望。下面是一些我摘抄的句子： 1.告诉你在这个险恶的世界上年轻人的希望在哪里，修炼强大的内心，你的人生永远你有出路！2.龙岗山上一轮月，仰见良知千古光。3.心即理，知行合一，致良知。4.一切战斗都是心战，内心的强大才是正真的强大！5.不要被自己的情绪所左右，偏激永远是因为你看的不够多。6.待一切都安静下来，不管你站在什么立场，且只问一句话：多久没有倾听自己的内心了？其实，世界是什么样子不重要，重要而是你需要什么！7.所谓天理，圣人之道，全在我心中，全在我与生俱来的秉性中，为圣之道，只需向自己的内心深处去挖掘和寻找。8心虽主乎一身，而实管天下之理，理虽散在万事，而实不外乎一人之心。9.此心安处是我家，给漂泊的心灵找一个归宿，给活着寻找一个意义。10.生命的价值在于她能够拒绝庸俗，能够灿烂奔放，但也可以在随波逐流中丧失任何意义，成为行尸走肉。11.立志，勤学，改过，择善！不立志就不可能勤学，不勤学也就无法成就。为人处世不可能无过，但应有过必改。你不可能让所有人都满意，但你应该让尽量多的人满意。同时，不仅自己向善，还要帮助他人向善。但责人向善必须注意方法，是人乐于接受，否则便会适得其反。12.幼稚的理想主义者为了理想去死，成熟的理想主义者为了理想而隐忍。13.俗话说得好，犯贱是普遍真理，你我只是其中之一。14.中国人的智慧是事缓则圆，一切都得慢慢来。15.有人的地方就有变数，有变数就有机会，从而可以推导出：人越多的地方机会越多。这就是无论哪行哪业，哪朝哪代，大家都爱往京城扎堆的原因。16.做起来，就能成，你要相信人可以凭借意志和内在的修炼成为你想成为的人！17.能有得力处，便是用力处。18.沉默里也包含着三种危险：疑而不问，蔽而 不辩，这是愚蠢的沉默；用不说话讨好别人，这是狡猾的沉默；怕被人看清底细，故作高深掩盖自己的无知无能，这是自欺欺人的沉默。19.不是你所处的环境决定了你的命运，而是你所做的决定注定了你的命运。当你制定一个目标时，整个宇宙都会让你知道接下来会发生什么。20.判断人生价值的标准不在外部世界，不在官职高低，不在权势大小，而在你的内心。心安自足，充实强大才是安生之本，成功之基。21.温和是顶级的暴力。22.坚强的意志和决心可以战胜一切困难，执着的信念和无谓的心灵才是最强大的武器。23.不用感谢我此刻的宽宏大量，所谓宽宏大量云云，皆因你目前的档次不够。24.低调是弱者的权利，强者从来不需要掩饰。25.招降是虚，进攻是实。要让对方绝望，必先给其希望，此所谓围师必阙。26.在这个世界上有人想脚踏两只船，左右逢源。有人想不问是非，抽身事外。但只有立场坚定的人，才可能有所作为。27.人可以不识字，但是不能不识相。28.困兽是不好斗的，但只要把它放出来，就好斗了。29.能改的叫缺点，不能改的叫弱点。30.懂得明哲保身不难，难的是懂得什么时候挺身而出。31.所谓敌人，不过是那些迫使自己变得强大的人。32.请求援军就好比买保险，用不上时痛苦，用上时更痛苦。33.心学是教会了很多人使用权术，但更重要的是，它教会了我们什么时候不用权术，这才是它之于这个历史悠久的泱泱大国的最更本的意义。34.乱世就是舞台，演技才是王道。35.历史的统治阶级无不是体制内给黄金，体制外给信心。36.政治选择了思想，而不是思想改造了政治。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"《数据统治世界》","date":"2017-03-29T16:27:15.000Z","path":"2017/03/30/《数据统治世界》/","text":"《数据统治世界》已经不是我第一次读与数据有关的书籍了，但是总感觉是不得其要领，比如说呢，你没有掌握学会用数据研判趋势的能力，但是我一直在路上，希望《信息分析与决策》和《数据、模型与决策》同时加上我炉火纯青的python造诣一定能够打通研判趋势任督二脉，哈哈哈哈，想想还有点小激动呢O(∩_∩)O~~。好了，废话不多，《数据数据统治世界》开喷： 《数据统治世界》这本书告诉你怎么怎么让数据自己说话，同时他会告诉你很多生活中看似不合理的安排，其实那都是有道理滴。本书中列举了大量的与统计式思维有关的例子，从中你可以感悟到数据已经统治了我们的世界，如果你读了这本书，同时你又是生活中的一个有心人，你会惊奇地发现在日常生活中，你也能运用数据来做决定了。 全书主要分为五章，第一章：“关注异常值而非平均值”，他会告诉你为什么迪士尼不去改变让游客牢骚满腹的长队。第二章：“相关比因果更重要”，主要举了疾病侦测和信用评分的例子。第三章：“分层与同类比较”。第四章：“假阳性与假阴性的博弈”。第五章：“小概率的力量”。 如果你想给自己的数据分析入门找一个落脚点，这本书是一个不错的选择，他会告诉你，我们究竟是怎么运用数据的，我们该怎么运用数据，数据与我们的生活息息相关！","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"《0.5秒决定你的人生》","date":"2017-03-29T16:23:15.000Z","path":"2017/03/30/《0-5秒决定你的人生》/","text":"我这个人很少读鸡汤文，看书名很像是吧，其实不是的，这是一本教你练习微表情的书，这本书其实就想告诉你：一个好的第一印象取决于我们的表情是否能让对方看的舒服，而非我们长的是否漂亮。心动了吧，其实稍加练习，你也可以做到。下面简要的介绍一下这本书的内容： 什么才是真正的笑容呢？书中是这样说的:眼睛要笑的弯弯的，颧骨部位要抬起来，只露出上排牙齿，左右表情对称。 发自内心的笑容能让我们产生脱胎换股的变化，拥有迷人的笑脸能让你拥有更多的机遇，一个良好的印象能够让你人生的成功率提高九成，一张让人舒心的笑脸能让你卖掉手头的商品…… 用迷人的笑脸和对方说谢谢，经常微笑能让你获得好运，微笑能在相遇的瞬间表达谢意，笑容能够播散幸福，笑容能够大大改观你的人际关系……那怎样才能获得美丽迷人的笑容呢？其实很简单，你需要的仅仅是每天对着镜子练习三分钟，看看你的眼睛有没有笑的弯弯的，你的颧骨有没有抬起来，你有没有只露出上排牙齿，你的左右表情是否对称，只要注意坚持，就能养成良好的脸部习惯。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"学习编程的秘诀!","date":"2017-03-29T13:38:40.000Z","path":"2017/03/29/学习编程的秘诀/","text":"学习编程的秘诀自然是学习解决问题的秘诀,那就拿编程中比较让人蛋疼的数据结构开始吧. 1.判断一个数字是否为素数?2.判断一个数字是否是回文数?3.编程实现求一个十进制数字的二进制形式….4……. 买到任何一本与数据结构有关的书籍,你总会看到无数的这种题,然后你就想啊想啊,想啊想啊,到最后你就是想不出来,然后你就痛苦,然后看下一道题你还是搞不定…到最后你竟然发现没有一道题你可以搞定的,然后你就开始怀疑你的智商,最后你就开始怀疑自己适不适合搞计算机,最终你竟然愚蠢的相信了自己不适合搞计算机…%&gt;_&lt;% 真相是数据结构与算法的题大部分人都是想不出来的,所以如果你想不出来,你不要觉得很痛苦,你去看答案,先看懂,然后去修改,看看改一下会有什么反应,多敲,这时候你对程序的理解就会慢慢加深,积累的多了你自然就学会了. 如果你实在看不懂,那你就用最”聪明”的方法–把它背下来.没错,其实这就是最聪明的方法.真正体验过的人就会知道,当一个很难很难的知识一直待在你的脑子里,然后你还时不时的拿出来想一想,最后你会发现一个神奇的现象,你竟然会了,而且你竟然不知道你为什么会了,恩,会的不需要理由,甚至于当有人问你为什么是这样的时候,你才发现自己也不知道为什么,就好像这个难题这样去解决是理所当然的事 对一些小算法的程序,尝试自己编程去解决它(大部分人都无法自己解决),如果解决不了就看答案,关键是把答案看懂,这个要花很大的精力,也是我们学习的重点.看懂之后尝试自己去修改程序,并且知道修改之后程序的不同输出结果含义.然后自己不看答案独立做出来. 如果程序无法彻底理解就把它背出来. 过几天回顾一次,再敲一次. 周而复始,总有一天你不加思考就敲出来了. 恩,其实大神就是这么走过来的,不过他没告诉你… (如需转载请注明作者和来源,给知识一点尊严,谢谢!)","tags":[{"name":"貌似有知识","slug":"貌似有知识","permalink":"http://yoursite.com/tags/貌似有知识/"},{"name":"编程随笔","slug":"编程随笔","permalink":"http://yoursite.com/tags/编程随笔/"}]},{"title":"学习和智商有关系吗?","date":"2017-03-29T04:51:19.000Z","path":"2017/03/29/学习和智商有关系吗/","text":"相信你们看到这个标题就知道我要说学习和智商是没有关系的,是的,注意哦,我说的是学习. 学习关键是你要知道怎么去学习,否则你只能做一个笨蛋. 作为一个非科班出身的野生程序员,从我开始到现在的自学经验告诉我,学习应该是这样的:首先,你要知道哪里有问题,然后把大问题分解成小问题,最后再一个一个地去解决,最终你肯定会搞明白所有的问题. 学习的关键就是你每天都要进步,哪怕你每天只懂了一点点.要记住:学习不是百米赛跑,学习是看不到尽头的马拉松.你每天都向前走一点,越往前走你会发现你前面的人越少,当你发现你在前面已经看不到人的时候,你就已经非常非常非常厉害了.有一点我是确信的,那就是我知道”未来会牛逼”的”笨蛋”,一定是具有成长型思维的”聪明人”! 什么是成长型思维?就是我们在做一件事的时候,不要看当下会发生什么,我们要学会走进一个长的时时间维度,跨进一个大的空间尺度,看看未来会发生什么.“三十年河东,三十年河西”,老祖宗留下来的话不是没有道理的. 说一个聪明人和一个笨蛋同时做一道题,前者用了一分钟做出来了,做出来之后他就不想这个问题了,过一段时间就忘了,他印象不一定很深刻.然而即便后者用了10分钟做出了,他为什么用来10分钟才做出来?可能的原因有两个,第一个是他真的笨,第二个就是想多. 如果这个笨蛋还是不明白,这个时他还会去一直思考这个问题,所以笨蛋第一次花了10分钟,但是第二次就只用花3分钟,第三次一分钟不到就做出来了,重点是这个问题还一直在他的脑子里,在他的心里.以后再遇到类似的问题不但可以信手拈来还能提炼升华 所以这个笨蛋最后未必见得就比聪明人学的差. 恩,其实我就是那个笨蛋O(∩_∩)O.","tags":[{"name":"貌似有知识","slug":"貌似有知识","permalink":"http://yoursite.com/tags/貌似有知识/"}]}]