[{"title":"如何把握市场趋势","date":"2017-06-05T07:44:57.000Z","path":"2017/06/05/如何把握市场趋势/","text":"","tags":[]},{"title":"商业的本质是什么？","date":"2017-06-04T14:43:32.000Z","path":"2017/06/04/商业的本质是什么？/","text":"价值的本质是什么？是稀缺性！不要以为有价值就有价格，空气最有价值，但是不具有稀缺性，他就没有价格。 前两天我在和一位朋友聊天，他的观点比较消极，大致意思就是大多数穷人，农民工的孩子受不了好的教育，然后继续成为了穷人，农民工，如此循环往复…… 去年暑假回家，我的另一位朋友和我聊天，他跟说了这么一句很有意思的话：“我老爹从小告诉我说，你要是考不上大学，你就得和我一样当一辈子农民。但是我没有上大学现在不是过得挺好的嘛。”我的这位朋友在去年买了自己的第一辆车，他就告诉我说他就只会两件事：1.会来事，2.会按摩。他的朋友多，他的按摩技术是他所在的地方按摩技术最好的，这就是属于他自己的不可替代的稀缺性。 你的报酬不是和你的劳动成正比，而是和你劳动的不可替代性成正比。在这个时代只要你不懒惰，勤于思考，勤于协作，你就能创造属于自己的不可替代的稀缺性。这个稀缺性哪里和你有没有上过大学有关系，哪里和你有没有干爹有关系，这个稀缺性是这个时代赋予你的，谁都夺不走。 也许未来的某一天会发生这样一件事，一个青年才俊上完大学，流洋海外，多年后回国在一家大公司任职，朝九晚五的工作，好不容易有一天假期出去打打高尔夫，恰好在高尔夫球场的高级教练就是他当年没高中毕业的中学同学，活的自由拿着和他一样的百万年薪。商业他有大半个身子都还藏在暗影之中，很多人就像盲人摸象里面的那个盲人。如果商业是一头大象，那么现在在我的心中我只看到了大象那只腿，所以现在在我的心中商业就是那根“柱子”，但是我发现有时候我一不小心就看到了那只大象，就只有那么一瞬间，总有一天我要把它从暗影里面拉出来，指着他的鼻子说：“好小子，被我逮到了吧”。 假设我们认为他现在就是一只大象，我相信当我们发现他的时候他一定不再会是一只大象，他一定是一个我们不知道的东西。《百年孤独》里面有这么一句话：“世界新生伊始，许多事物还没有名字，提到的时候尚需用手指指指点点。”到时候我们对别人提到他的时候会指着他对别人说，就是他，就是他。 说了这么久有人就要问了，那你说到底什么是商业？我会说商业的本质是钱，钱的本质是价值，价值的本质是稀缺性……说简单一点其实就一个字——“人”。商业，这个话题太大，需要我们持续的去探索和发现。 我觉得无论在那个时代，不管你是企业还是个人，是小公司还是一个小的组织，你都需要记住一句话：“大到极致，小到入微。”什么叫大到极致？说白了格局要大到极致，要学会放眼全局，你不要只看到腾讯和阿里在争夺支付入口，你要知道他们想要的到底是什么。什么叫小到入微？做事要小到入微，宽度一微米，深度一公里，你要学会先用轻型武器试水，精确定位，找准靶心，然重型武器配比弹药，定点清除，永绝后患。 今天看了老罗 Smartisan T2 的新品发布会，有两句话我想分享给大家。 “未来属于我们当中那些仍然愿意弄脏双手的少数分子” “通往牛逼的路上，风景差的让人只想说脏话，但创业者在意的是远方” 你永远不要觉得有些东西离你太远，你可以选择拒绝，因为时代也是这么做的。马云说过一句很有意思的话：“这是一个抢钱的时代，哪里有时间和那些思想还在原始时代的人磨磨唧唧”。","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"}]},{"title":"我所理解的商业","date":"2017-06-04T12:26:32.000Z","path":"2017/06/04/我所理解的商业/","text":"写完了《迷茫时代的明白人》的读书笔记，忽然想谈一下自己对商业的一些所见所闻所感。智识有限，也许多年以后的我回头来看自己当年写的这篇文章就会像现在我看大多数人的文章一样说一句“写的什么东西！”。但是灵魂深处的另一个我还是劝我写点吧，于是你就看到了这篇文章。 2015年我大言不惭，脸不红，心不跳地给一个非常喜欢做生意，情商高，智商高的好朋友说我理解的商业，我给他说了下面这些话…… 商业，我认为有五个等级。买卖，生意，企业，模式，资源整合，资本运作！ 什么是买卖？买卖就是你用五块钱买一块布，然后你以十块钱卖的价格卖出去，这就是买卖，在这个过程中产生了两倍的“资本溢价”。 什么是生意？生意就是你买来一块布，把这块布做成了衣服，然后以五十块钱的价格卖出去，这就是生意，在这个过程中产生了五十倍的“资本溢价”。 什么是企业？企业就是我买来一块布，把它做成了衣服，然后把这件衣服做成了品牌，我有了自己的仓储，物流，供应链，我把衣服发给我的分销商，这时候我再把这件衣服卖出去价格可能就是五百元，这就是企业，在这个过程中产生了五百倍的”资本溢价”。什么是模式？模式就是我买来了一块布，把这块布做成了衣服，把衣服做成了品牌，这个时候我不去建立自己的仓储，物流，不去搭建自己的供应链，不去弄那些，弄那些有什么用，没用！这个时候我把仓储，物流全都外包出去，甚至在这个时候我可以不去搭建自己的供应链，因为在这个时代最好的供应链就是“人”。然后我把更多的钱投入到我对产品品质的把控，质量的提高，款式的卓越追求，粉丝生态圈的营建，对用户诉求的深度挖掘，然后我们用“态度营销”去塑造去培养以穿我做的服装引以为豪的那一小撮人，没错，我们需要的就是那一小撮人，因为在这个时代你永远不要不屑于个人力量的崛起，尤其是一群有“态度”的一小撮人。 什么是资源整合？什么是资本运作？关于这些我懂得其实也不是很多，这里就暂且不说了。","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"}]},{"title":"《特劳特营销十要：笔记二 建立品牌》","date":"2017-06-03T05:02:16.000Z","path":"2017/06/03/《特劳特营销十要：笔记二-建立品牌》/","text":"1.品牌名称 2.品牌战略 3.专注 4.贪婪 Branding is all about differnetiating your product or company in the maid of your customer. 产品制造于工厂，而品牌是在心智中创建的。 1.品牌名称一个好的名字对取得成功有很大的帮助。 最好的品牌名称是与产品的优势卖点相关联的。比如‘长命’就是一种耐用电池，‘一擦净’就是一种玻璃清洁剂，而‘深度护理’是一种护肤乳。 另一个窍门就是使用听起来很美好的名称，比如‘关爱’沐浴香皂或‘特甜蜜’糖精，等等。在很多情况下，记忆是靠听觉形成的，因此你要回避那些听起来很奇怪的名称，像优耐陆、安捷伦或是齐乐格，而应该选择一些动听的名称，如悍马或讴歌。 由于品牌是在心智中创建的，所以，你所能做的最重要的营销决定，就是如何命名产品。名称是心智中的挂钩，上面挂满了小衣架，人们用这种方式存放品牌。一个易于记忆的好名称会是一个好的开端，而糟糕的名称则可能会引起很大的麻烦。 2.品牌战略品牌战略的目的是为产品或公司在你所属的领域建立差异化，像杰克·特劳特所说的——如果你没有差异化，你最好能够提供较低的价格。 建立品牌的关键是想办法表达你的差异化。如果你更快、更迷人、更安全或更新颖，就很容易做到这一点。但通常是你不得不去寻找其他一些非产品本身的特性，比如领导地位、消费者偏好和传统观念等。无论你选择了什么，你都要利用它们来为你的顾客创造利益。许多公司恰恰不能理解这一点，它们所推崇的只是空洞的、无意义的口号。迈克尔·波特说得对，‘竞争战略就是要建立差异化。’这就意味着要审慎选择一系列独特的活动以体现独一无二的价值组合，战略的本质是要以行动来体现的，即选择不同于竞争对手的独特行动方式或开展与众不同的活动。否则，‘战略’就只能是经不起竞争考验的营销口号。 品牌战略就是在潜在客户心智中建立品牌以及差异化概念。 3.专注品牌是一种承诺，它建立了产品所必须实现的预期。 维护品牌和让其免受内部力量的摧毁往往比创建一个品牌更难。 有时候企业为了达到管理人员所要求的数字指标，便开始做一些有损品牌的事情。 比如说，为了获得更多的业务，组织失去了焦点，不再聚焦自己的独特之处。它们进行侵蚀核心品牌的活动，追求本不应追求的业务。例如，万宝路试图销售薄荷香烟，凯迪拉克试图销售小型凯迪拉克汽车，保时捷试图销售运动型多动能汽车，等等。有时它们还会创建子品牌，希望能将它们新的努力成果合理化，例如，假日酒店的子品牌皇冠大酒店。但顾客感觉皇冠大酒店似乎有些贵，不符合假日酒店在人们心智中物美价廉的定位。 对于高端品牌打入低端市场，就拿沃特福特水晶来说。沃特福特水晶试图通过销售侯爵水晶打入低端市场，其实，这种廉价水晶做得越成功，对昂贵的沃特福特品牌的损害也就越大。品牌是一种承诺，它建立了产品所必须实现的预期。 单一的品牌如果想以多种形式来销售，只需要做到不同的形式或式样不偏离品牌精髓，不削弱其差异化概念就行。如果沃尔沃是看上去像坦克一样安全的汽车，那么敞篷的沃尔沃在消费者心智中就是不合理的；如果耐克是给世界顶级运动员穿的，那么耐克牌高尔夫球就没有存在的意义——因为耐克高尔夫球根本没法穿。大多数人觉得好的高尔夫球应该是老虎伍兹所使用的高尔夫球，而不是耐克牌高尔夫球，因而老虎伍兹牌高尔夫球要比耐克牌高尔夫球好卖得多。 4.贪婪品牌战略就是将特定品牌连同其差异化根植于顾客的心智中。诀窍就是把精力集中于品牌的核心特征上，而不是过于贪婪，将品牌过分延伸。 怎样才能避免丧失品牌焦点呢？答案就是舍弃。有时候舍弃一些东西对你的业务会有好处。如果你对较长一段时期的产品种类目录进行研究，你就会发现过多地增加品种只会削弱增长速度，而不会对增长有任何帮助。增加的品种越多，基本的差异化概念被损伤的风险也就越大。 舍弃有三个方面： 首先是产品舍弃。例如，金霸王专营碱性电池，肯德基专营鸡肉食品，西南航空公司专门从事短途航空旅行。 其次是特性舍弃，也就是说要将精力集中在一种产品特性上。例如，沃尔沃强调其产品的安全性，戴尔强调直销，棒！约翰比萨强调好的原料。你的产品可能会拥有多种特性，但你传递的信息一定要集中在产品的核心特性上。 最后是目标市场舍弃，也就是说要将精力集中在某一品类的一个目标细分市场上，这样，你才有能力成为该细分市场备受青睐的产品。例如，得伟专营专业工具，百事主要面向年轻一代，雪佛兰的一款跑车考维特主要针对追求年轻的一代……如果你同时追寻其他的细分市场，你就可能会失去原有的顾客。","tags":[{"name":"营销","slug":"营销","permalink":"http://yoursite.com/tags/营销/"}]},{"title":"《特劳特营销十要：笔记一 营销的本质是什么》","date":"2017-06-02T22:08:58.000Z","path":"2017/06/03/《特劳特营销十要：笔记一-营销的本质是什么》/","text":"1.营销的本质是什么？ 2.如何处理预算？ 3.坚持到底的重要性 4.分销的重要性 1.营销的本质是什么？Marketing is like making a good movie in which your product is the star. A good movie will sell a lot of tickets. 营销就是要确定为了销售产品和提供服务以获得利润都需要做哪些事情。 营销工作的职责就是发现新理念并将其用语言描述出来，同时使其成为完善的营销战略，然后释放出它的能量。 那怎样才能识别成功的营销计划，并从中获得启发呢？ 阅读每一期的《商业周刊》、《财富》、《福布斯》、《华尔街日报》。当这些杂志、报纸在撰述公司故事时会发表相关的分析，并列出分析方法，阅读这些成功或失败的故事会比阅读那些营销专著有用得多。 市场营销就是要把事情简单化，直接切入到如何销售产品这个核心上。 好的营销如同制作一部电影，你必须把一大堆琐碎的镜头放到一起，拼凑成一个完整的故事。也就是说，营销就像一部电影，而产品就是电影中的明星。电影中的每个人、每件事都是在讲述一个简单的故事。这个故事就是要告诉人们“为什么我的产品与众不同，为什么你应该购买我的产品而不是其他产品”。如果你的产品能够解决一个问题，那么你首先应该将这一问题戏剧化，然后用你的产品去化解矛盾；如果你的产品是后来者，那么你应该将市场上现有的产品做一个介绍，然后戏剧化地将你的产品的新颖独到之处展示出来；如果你的产品有一个较强的竞争对手，你就应该解释为什么你的产品是一个更好的选择。千万不要‘跟风’。 2.如何处理预算？所谓预算其实就是花足够的钱把你的故事讲给目标市场听。 第一步，准备市场营销计划，按营销生命周期来展示每一种产品。分析一下这是不是一个新的市场，已有的竞争程度如何，差异化在哪里，人们对你的产品以及竞争对手的产品的认知如何。这些计划必须是客观的、建立在事实基础之上的，不应有任何主观臆断。 第二步，评估产品机会。如果工作进展顺利的话，有了这些数据，你就能够判定：哪一种产品能够提供更多的潜在利润；这种产品或服务能否赢得价格优势；这是不是新一代理念，能够帮助你成为这一市场的领头羊；这是不是一种存在激烈竞争的产品。 因为你不能预知未来，所以这一步就需要你去做一些训练有素的推测工作。你要尽力去做的就是评估每一种产品或服务，然后确定哪一种有最好的投资机会。 你应该认真评估每一次战斗的激烈程度，竞争越弱，成功的机会就越大，与地位稳固的敌人对抗可不是什么有趣的事情。 第三步，安排广告工作。由于广告往往是营销计划中费用最高的部分，所以要确保广告预算用在最有效的地方，这一点相当重要。花足够的钱把你的故事讲给目标市场听。 比如说，广告在创建新理念或新产品的知名度上特别有效，在比较你与竞争对手的产品和突出差异化方面也能起到强有力的作用。但你若想说服潜在顾客或改变顾客的心智，广告就不是很有效了。 如果你只想取悦目标客户，不在潜在顾客的心智中建立‘差异化’，这样的广告则没有多大用处。 第四步，资金不足时应该立刻停止。在这一点上，首席执行官要讲究策略。一旦你将各个项目按照获利可能性和工作有效性排出优先次序，你就要从高往低开始分配预算。如果你所能支付的只是三个大项目，那就只能做这三个项目。当你的资金到达极限时，你就必须将其余的项目舍弃，等待下一年去重新评估。这样做确实很痛苦，但你必须在做计划时避免将有限的资金覆盖到过多的项目上，这样会让所有的努力付诸东流。你要用最大的努力获得最大的回报。” 3.坚持到底的重要性实施好的概念胜过拥有好的概念，赢得一个客户永远比维护已有的客户代价高的多。 坚持到底是好的计划和好的结果之间的桥梁，营销工作同样需要持之以恒。这一过程要保证涵盖所有的细节，并且这些细节全部都能得到妥善的处理。 坚持到底还意味着，‘一旦得到顾客就要牢牢地抓住他们’。在这一点上，你可以利用各种办法保持同客户的联系，并让他们感觉到你始终关心着他们。如果你犯了错误，要马上和你的客户联系并向他们道歉，同时为他们提供额外的补偿。有人称之为‘一对一营销’，我则称之为‘保持联系’。记住，赢得一个新客户永远比维护已有客户的代价高很多。” 4.分销的重要性关于分销你首先要知道，越直接越容易控制。换句话说，如果必须通过中间商的话，就等于放弃了一部分利润和对产品的控制权。比如说迈克尔·戴尔省略了电脑零售商进行直销，非常成功，而其他公司还在拼命地挣扎。 其次，如果你选择了分销，你要知道不要与你的客户竞争。一旦你选择了分销体系，比如说通过小型专业零售商来进行销售，你就不要因为贪心而在自己的店里直接销售。那样做的话，分销商会立刻对你的产品失去兴趣。好的分销渠道要求你对渠道保持忠诚。如果你想要你的销售商忠于你，那就不要通过他们的竞争对手——大型销售商来销售你的产品。 最后也是最重要的一点，就是‘让我看到钱’。分销商卖你的产品赚到的钱越多，他们对你的关注也就越多。这就意味着你的工作就是要使你的产品对分销商的客户（即消费者）更具吸引力，也就是说，你必须要把营销工作做好。","tags":[{"name":"营销","slug":"营销","permalink":"http://yoursite.com/tags/营销/"}]},{"title":"从营销看企业家的新角色","date":"2017-06-02T15:05:32.000Z","path":"2017/06/02/从营销看企业家的新角色/","text":"什么是企业家？华尔街对于企业家有一个全新的定义：企业家就是看得懂资产负债表的营销专家。 新的竞争环境要求整个企业组织就是一个营销机构，而企业家的首要角色是营销战略家。 同时，企业经营的重心也转移到了对消费者心智的争夺。除非你能在消费者心智中建立起品牌的区隔，否则消费者将找不到选择你的理由。这就是定位之父杰克.特劳特在所强调的：品牌战略的本质在于实现品牌的差异化。因为在大竞争时代，对于品牌来说，要么差异化，要么消亡。所以杰克·特劳特说：“在营销操作展开之前，有一个最关键的步骤就是为品牌定位。”他指明了营销的目标、企业经营的方向，企业一切的营销组织和资源配置都要围绕着定位展开。要让品牌在消费者心智中占据何种定位，成了企业经营活动的战略性方向，而企业家是这个方向的设计师。","tags":[{"name":"营销","slug":"营销","permalink":"http://yoursite.com/tags/营销/"}]},{"title":"Critical thinking","date":"2017-06-02T05:01:25.000Z","path":"2017/06/02/Critical-thinking/","text":"we are bombarded with so many decisions, that’s impossible to make prefect choice every time. But there are many ways to improve our chances,and one particularly effective technique is critical thinking. This is a way of approaching the question, that allows us to carefully deconstruct the situation,reveal its hidden issues,such as bais and manipulation and make the best decision. a person who use criticla thinking, subjects all available options to scrutiny, and skepticism. There many different ways of approaching critical thinking. Here is one 5 steps process that may help you solve any number of problems. 1.Formalute your questionIn other words,know what you are looking for.This isn’t always as straightforward as it sounds.For example, if you are deciding whether to tyr out the newest diet craze, your reasons for doing so may be obscured by other factors, like claims that you will see results in two weeks.But, if you approach the situation with a clear view of what you’re actully trying to accomplish by dieting whether that’s weight loss,better nutrition, or having more energy, that’ll equip you to sift through this information critically,find what you’re looking for and decide whether the new fad really suits your needs. 2.Gather your information There’s losts of it out there, so have a clear idea of your question will help you determine what’s relevant. If you’re trying to decide on a diet to improve your nutrition, you may ask an expert for their advice, or seek other people’s testimonies. Information gathering helps you weigh different options, moving you closer to a decision that meets your goal. 3.Apply the informationsomething you do by asking critical question. Facing a decision, ask yourself : ‘What concepts are at work?’, ‘What assumptions exist?’,’Is my interpretation of the information logically sound?’. For example, in an email that promises you millions, you shound consider ‘what is my shaping my approach to this situation?’,’Do i assume the sender is telling the truth?’,’Based on the evidence, is it logical to assume I’ll win any money?’. 4.Consider the implicationsImagine it’s election time, and you’ve selected a political candidate based on their promise to make it cheaper for drivers to fill up on gas. At first glance, that seems great. But what about the long-term enviromental effects? If gasonline use is less restricted by cost, this could also cause a huge surge in air pollution, an unintended consequence that’s improtant to think about. 4.Expolre other points of viewAsk yourself why so many people are drawn to the policies of the opposing political candidate. Even if you disagree with everything that candidate says, exploring the full spectrum of viewpoints might explain why some policies that don’t seem valid to you appeal to others. That wil allow you to explore alternatives evalute your own choices and untimately help you make more informed decisions. This five-step processes just one tool, and it certainly won’t eradicate difficult decisions from our lives. But it can help us improve the number of positive choices we make. Critical thinking can give us the tools to sift through a sea of imformation and find what we’re looking for.It has the power to make the world a more resonable place. tips:source","tags":[{"name":"心智","slug":"心智","permalink":"http://yoursite.com/tags/心智/"}]},{"title":"《见微知著：笔记二 界面整体布局及配色方案》","date":"2017-05-21T13:02:26.000Z","path":"2017/05/21/《见微知著：笔记二-界面整体布局及配色方案》/","text":"1.界面布局 1.1一栏式布局 1.2两栏式布局 1.3三栏式布局 1.4设计要点 2.网站整体配色方案 2.1不同的颜色会产生不同的主观感受 3.网站特色 3.1目标用户群体 3.2网站类型 3.3品牌形象 有一个知名的效应称为首因效应，指的是第一印象的形成导致的在总体印象形成上最初获得的信息比后来获得的信息影响更大。因此我们应该利用首因效应，着重设计好给用户留下第一印象的整体布局、内容和视觉设计等，这些也是网站最。 合理的布局应该符合用户的浏览习惯，合理的引导用户的视线流；清晰有效的布局能够让用户对网站的内容一目了然，快速了解内容的组织和逻辑，大大提升网站的可阅读性和整体视觉效果。 配色方案包括网站的主色调、辅助色、背景色等，适当的配色方案能够引起用户的共鸣，从情感上提升用户体验。 1.界面布局1.1一栏式布局一栏式布局页面结构简单、视觉流清晰，便于用户快速定位，但由于页面排版方式的限制，只适用于信息量小、目的比较集中或者相对比较独立的网站，因此常用于小型网站首页以及注册表单页面等。 采用一栏式布局的首页优点在于信息展示集中、重点突出。通常都会通过大幅的精美图片或者动态Flash来实现强烈的视觉冲击力，给用户留下深刻的印象，提升品牌效应，留住用户进一步浏览。但是展示的信息量有限，因此需要在首页中添加导航或者是重要的入口链接等，起到入口和信息分流的作用。 一栏式布局还适用于目的性单一、较为独立的二级页面或者更深层次页面，如注册表单页面，用户只聚焦在表单填写上，因此除表单外只需提供返回首页及少数重要入口即可。 1.2两栏式布局相对于一栏式布局他可以容纳更多的内容，相对三栏式布局来讲，信息不至于过度的拥挤和零乱，但它不具备一栏式布局的视觉冲击力和三栏式布局超容量的特点。 两栏式布局根据其所占的面积比例不同，将其分为左窄右宽、左宽右窄、左右均匀这三种类型。虽然表面上看只是比例和位置不同，但它实际上影响到的是用户浏览的视线流以及页面的整体重点。 1.2.1左窄右宽式这种形式的布局通常采用左边是导航（以树状导航或者一系列文字链接的形式出现），右边是内容的设置。此时左边不适宜放次要信息或者广告，否则会过度干扰用户浏览主要内容。用户的浏览习惯通常是从左到右、从上到下，因此这类布局的页面更符合理性的操作流程，能够引导用户通过导航查找内容，使操作更具可控性，适用于内容丰富，导航分类清晰的网站。 1.2.2左宽右窄型这种结构明显突出了内容的主导地位，引导用户将视觉焦点放在内容上。在用户阅读内容的同时或者之后，才引导其去关注更多相关信息。 这种方式的右侧也可以放置次要信息或者广告，体现出信息的主次。 1.2.3左右均匀型这种类型采用的较少，适用于两边信息的重要程度相对比较均等的情况，不体现出内容的主次。 对比着三种方式，可以看到每种方式的内容重点和视线流的方向都是不一样的。左窄右宽型的导航位置相对突出，引导用户从左至右地浏览网站，即从导航寻找信息内容；而左宽右窄型的左侧往往放置信息内容，可以让用户聚焦在当前内容上，浏览完之后才会通过导航引导用户浏览更多相关的内容。 1.3三栏式布局三栏式布局紧凑可以更好的利用网页的空间，但是这难免造成了信息量的拥挤，增加了用户的查找时间，降低了用户对网站内容的可控性。 1.3.1中间宽、两边窄这类布局引导用户将视线流聚焦于中间部分，重点较为突出，但却容易导致页面的整体利用率降低。 1.3.2两栏宽、一栏窄较宽的两栏常被用来展示重点信息，较窄的一栏常用来展示辅助信息。虽然能展示更多的内容，但是重点没有第一种方式突出。 1.4设计要点1.4.1选择合适的布局方式在设计布局时，最重要的是根据信息量和页面类型等选择适合的分栏方式，并根据信息间的主次选择合适的比例，对重要信息赋予更多空间，体现出内容间的主次关系，引导用户的视线流。 针对某个新闻等具体页面，新闻内容才是用户最为关注的内容，导航等知识辅助信息，因此是和采用一栏式或者新闻内容为主的两栏式布局。 1.4.2通过明显的视觉分区保持整个页面的通透性有时候网站板块间的设计缺少统一的规范，就很容易导致各版块间的比例不一致，从而在视觉上给用户一种零乱的感觉，也容易打断用户较为连贯流畅的视觉流。 保持整个页面的通透性，只需要统一各版块间的比例，同时通过线条、颜色等视觉元素增加各栏间的区分度，就可以轻松做到。 1.4.3按照用户的浏览习惯及使用顺序分布摆放内容在页面布局设计时，应该尽量将重点内容放在左上角，右侧放置次要内容。 1.4.4统一规范，提升专业度对于网站内的不同页面类型，应该选择适合的页面布局。对于同一类型或者同一层级的页面，应尽量使用相同的布局方式，避免分栏方式的不同、甚至是各栏比例上的细微变化，以保持网站的统一性和规范性，使网站显得更加专业。 2.网站整体配色方案颜色对眼睛的刺激往往比文字来的直观，更能抓住用户的注意力。不同的颜色能够让用户产生不同的情绪。因此好的配色方案不仅能够给用户带来美的视觉享受，加深用户对网站的印象，增加对网站品牌的认可和辨识度。 网站主色调是最重要的一个元素。到底该选择哪种颜色，鲜艳还是朴素，活泼还是庄重，大众化还是个性化都是配色方案所涉及的。 网站的类型、品牌形象、整体定位、目标群体等多种因素都会影响到颜色的选择，而颜色本身也具有自己的特性以及含义，因此需要匹配颜色特性和网站特色来选择适合的主色调。 2.1不同的颜色会产生不同的主观感受如暖色调会给人带来温暖的感觉，同时具有扩张感，使暖色的元素从背景中跳出来；而冷色调则给人冷清、冷静的感觉，具有收缩的作用，因此容易隐入背景之中。纯度高的颜色饱和度高，较为艳丽，纯度低的则较为柔和。明度高的颜色会带来轻快的感觉，而明度低的颜色则显得比较庄重。取有对比的色相和明度则令人感到活泼，取类似、同一色系则令人感到稳健。色相数多则会显得华丽，色相少则会显得淡雅清新。 每个颜色都有自己的含义，带给用户不同的主观感受。下面是几种常见的颜色： 红色被认为是最热情的颜色，代表了兴奋、激情、奔放和欢乐，容易让人联想到旗帜、激情、危险、火灾、血液、竞争、侵略、警报等，对人眼刺激较大，容易造成视觉疲劳，使用时需要慎重考虑。因此不要采用大面积的红色，它常用于Logo、导航等位置。 橙色是非常温暖的颜色，通常代表着激情、欢乐、健康等。阿里系基本都采用橙色作为主色调，独特、识别度高，成为公司的一个象征。但和红色类似也容易造成视觉疲劳。 黄色通常给人轻快、明亮、乐观的印象，有扩张的视觉效果，因此采用黄色作为主色调的网站也往往呈现出活力和快乐。通常黄色还容易让人联想到黄金、缎带，因此也往往代表着高贵和富有。不同的黄色往往会带来不同的效果，因此在设计时需要注意细节的差别。 绿色具有黄色和蓝色两种成分的色，作为中性的颜色，绿色往往代表着平和、恬静、谦虚、智慧和生命力。也常用财经网站或者那些代表富饶、康复和生态学的网站。 蓝色的色感较冷，通常代表着冷静、沉思、智慧、自信和神秘，就如同天空和海洋一样，深不可测。同时，蓝色也是现代科技的象征色，如IBM等科技公司都采用蓝色作为公司网站主色调。 紫色的明度较低，给人以高贵、优雅、浪漫和神秘的感觉，同时也表示公正和真相。但眼睛对紫色光的细微变化的分辨力很弱，容易引起疲劳。 黑色往往代表着严肃、恐怖、冷静。它本身是无光无色的，当作为背景色时，能够很好地衬托出其他颜色，尤其与白色对比时，对比非常分明，白底黑字或者黑底白字的可视度很高。 白色是全部可见光均匀混合而成的，称为全色光，通常代表着明亮、简单、干净、纯真与和平。白色很少单独使用，通常都与其他颜色混合，纯粹的白色背景对于内容的干扰最小。 灰色往往代表中性、稳重和智慧。它不容易产生视觉疲劳，但是也容易让人感到沉闷。当然也有漂亮的灰色会给人高雅、精致、含蓄的印象。 当然颜色的略微变化，也可以带来不一样的感觉。在红色中加入少量的黑，会使其风格变的沉稳，趋于厚重、朴实；加入少量的白，会使其风格变的温柔，趋于含蓄、羞涩、娇嫩。如果在橙色中黄的成分较多，其风格趋于甜美、亮丽、芳香；在橙色中混入小量的白，可使橙色的感觉趋于焦躁、无力。在绿色中黄的成分较多时，其风格就趋于活泼、友善，具有幼稚性；在绿色中加入少量的黑，其风格就趋于庄重、老练、成熟；在绿色中加入少量的白，其风格就趋于洁净、清爽、鲜嫩。 3.网站特色网站目标用户群体，网站的类型，以及网站的品牌形象等因素在很大程度上决定了网站的色调选择。 3.1目标用户群体在设计时需要考虑当地的文化因素。比如红色在墨西哥表示诅咒，在其他一些西方国家红色也往往象征着残暴，流血，应尽量避免使用。 此外，不同的性别、年龄、教育背景等都会影响人们对于色彩的理解和偏好。 比如说，针对年轻人的网站应该轻快活泼，使用鲜艳或者是较饱和的颜色。针对老年人的网站应该宁静，不应过于花哨，灰色系是一个不错的选择；针对商务人士应该庄重有质感。 3.2网站类型不同的网站类型以及网站的定位都会影响到颜色的选取，当然网站类型也与目标用户群体息息相关。 门户类网站通常给人大众、专业、稳重的印象，因此主色调也往往在常用颜色中选取，适合大部分人的品位。如腾讯的浅蓝色、新浪网的黄色、Yahoo！的紫色和MSN的蓝色，在保持网站品牌形象和个性的同时，符合了大部分用户的审美。同时，由于门户网站主要以资讯内容为主，因此应尽量减少颜色等元素对于内容浏览的干扰。 电子商务网站的颜色则非常绚丽，给人激情、热闹、舒适的印象。比如淘宝的红色系，百度有啊的红色系。较多使用暖色调，刺激用户的浏览和购买。 eBay的主色对非常巧妙的将logo中的四种颜色搭配在一起，互相呼应，整个页面看上去非常清爽和谐。 淘宝主页从Logo到导航、按钮等一致地沿用了橙色系的元素。但到具体的垂直类别时，对不同分类都进行了个性化的设计。对于娱乐、女人等目标用户主要为女性用户的类别，采用较为饱和的红色，带来温暖、热情的感觉；对于亲子类别，目标用户群体主要为孕妇，采用了较为柔和的粉红色；对于男人、运动和汽车等目标用户主要为男性的类别，都采用了冷色调，给人更加冷峻、沉稳的感觉。 社交网站一般会给人轻松，互动的氛围。除此之外需要结合目标群体的特征，选择合适的颜色。如QQ校友的用户群体相对年轻，因此使用绿色较为轻快，有活力的颜色。而Linkedin的用户群体主要为商业客户，因此颜色相对稳重，职业化。 垂直类网站由于范围较窄，因此与其领域的特色紧密相关，体现出相关性和专业性。如金融类网站需要体现出正式、庄重，因此往往采用稳重的颜色。中国工商银行网站就采用了银色和红色体现出金融以及稳重的感觉。 汽车类网站则通过颜色、图片等共同体现出质感、稳重、速度等，给人造成强烈的视觉冲击。 政府网站相对比较严肃庄重，因此适合使用颜色较深的色调。 企业网站可以根据其产品特点创造独有的风格。 3.3品牌形象每个公司由于其产品特色以及企业文化等的不同，都会形成自身独特的品牌形象。尤其对于知名网站/企业来讲，多年的品牌营销使品牌形象/品牌色深入人心，因此网站沿用品牌色将有助于提升网站/企业的整体形象。 最常见的一种方式就是增加网站主色调和logo之间的关联，因为logo的设计本身就体现出了其定位及品牌形象。如前面提到的eBay，网站主色调采用了Logo的4种颜色的组合，增加了用户对于网站的认知度和识别度。 对于科技类网站，通常选择蓝色，黑色等象征现代科技的颜色，如IBM的蓝色巨人已经深入人心，因此网站的主色调也应该围着蓝色，使其更加符合品牌形象。 （网站Logo、导航等多种元素间使用统一的颜色，可提升品牌形象和品牌认知度，使网站更加和谐。） 网站还需要搭配辅助色、点睛色、背景色，形成完整的配色方案。其中： 辅色调。仅次于主色调的视觉面积的辅助色，用于烘托主色调，营造网站整体氛围。 突出色。在小范围内用强烈的颜色对比来突出重点元素，使页面更加鲜明生动，主要用于占用范围较小的按钮、标签等。 背景色。用作背景的颜色，协调、支配整体的作用。 每一个颜色对于网站都至关重要，合理搭配才能使网站颜色更加赏心悦目，重点突出，因此设计时都需要仔细斟酌。 同时网站的图片、文字、按钮等元素的颜色都需要互相搭配，达到网站的整体和谐，提升网站的整体氛围。","tags":[{"name":"UI设计","slug":"UI设计","permalink":"http://yoursite.com/tags/UI设计/"}]},{"title":"《见微知著：笔记一 网站解构入门》","date":"2017-05-21T04:53:27.000Z","path":"2017/05/21/《见微知著：笔记一-网站解构入门》/","text":"1.什么是用户体验？ 2.为什么要网站解构？ 3.网站解构的思路和维度 3.1整体界面布局及配色方案 3.2主要功能区 3.3页面元素 3.4其他细节 1.什么是用户体验？网站的用户体验指的是由于网站的作用、品牌形象、操作的便利性、网速的流畅性以及细节设计等综合因素，最终影响到用户访问网站时的主观体验，包括用户是否能成功完成任务、是否喜欢网站、是否还想再来。 就像进入一家餐厅，除了菜式本身的可口之外，餐厅的装修、座位的分布、服务员的微笑，甚至是一句简单的“请”或“谢谢”，所有的细节都会影响到用户的整体情绪。 一个不起眼的细节，可能让用户倍感欣喜，却也可能导致错误带来沮丧。 要有更好地用户体验，不仅需要更快的速度、更好的内容，更需要从细节处着手，设身处地的从用户的角度来思考问题，体现出网站对用户的尊重和贴心。 2.为什么要网站解构？交互设计倡导的就是“it depends”的精神，没有最完美的设计，只有最适合的设计。如果没有设计规范或者相关的设计、研究结果，设计师往往需要不断地尝试、借鉴和摸索，花费大量时间和人力，对网站进行设计或改进。 对于全新的网站设计，你可以先从整体上确定网站的布局和配色方案，然后将网站所需要的元素进行解构，仔细斟酌每一个细节的设计，然后再从整体的角度来检验每个细节是否符合全局的需要，而后进行局部的调整。 对于已有网站进行改进设计，你可以有针对性地对某些元素进行分析,找到最适合改进当前网站的交互方式。为了更有针对性的改进个元素或者模块的设计，最好通过可用性测试或专家评估等方法先从全局的角度发现问题所在。 3.网站解构的思路和维度一个网站往往包含了非常多的元素，我们先从整体着手，然后再细化解构到各细节元素。 3.1整体界面布局及配色方案从整体来看，网站最重要的就是信息架构、内容和视觉设计。 信息架构作为网站最核心的骨架，代表了产品内容的组织形式，表现为产品功能信息分类、分层的关系，在设计上主要体现为界面布局和导航，视觉体现为网站的配色方案。这些都将在下一章中详述。 （信息架构最好通过卡片分类法等进行统计分析，使其符合用户的心理模型） 3.2主要功能区网站的功能区指的是除整体布局之外，组成页面的需要区域，通常按照其功能进行划分。 主要包括：头部，页尾、导航区、搜索区、登录注册区、主要信息展示区、广告区等主要功能区。 3.3页面元素页面元素包括表单、标签、链接、翻页、按钮、反馈、验证码等，常用于各功能区域之中。 这些元素的细节设计是交互设计中非常重要的一部分。 如表单可用于注册表单、购买表单等。通过优化表单，可以提升用户注册率或者商品成交率等。 3.4其他细节其他细节还有：字体，网站文字的语气等细节也都对用户体验起着非常重要的作用。 其中字体包括字型、字号、字体与背景的颜色对比等。","tags":[{"name":"UI设计","slug":"UI设计","permalink":"http://yoursite.com/tags/UI设计/"}]},{"title":"《明朝那些事 第一部:洪武大帝》","date":"2017-05-20T14:54:06.000Z","path":"2017/05/20/《明朝那些事第一部；洪武大帝》/","text":"1.这是一个伟大的转变,很多人可能穷奇一辈子也无法完成.转变的关键在于心.是的,即使你拥有人人羡慕的容貌,博览群书的才学,挥霍不尽的财富,也不能证明你打强大.因为心 的到强大,才是正真的强大。 2.自古以来,建立一个王朝很难,毁灭一个却相对容易的多,所谓”墙倒众人推,破鼓万人捶”,不是没有来由的。 3.知道可能面对的困难和痛苦,在死亡的恐惧中不断挣扎,而仍然能战胜自己,才是真正的勇气. 4.在军队里,朱重八很快就表现出了他的才能.比起其他的农民士兵,他是一个很突出的人,不但作战勇敢,而且很有计谋,处事冷静,思虑深远(注意这个特点),还很讲义气,有危险的时候第一个上,这一切都让他有了崇高的威信.他从不贪图财务,每次得到战利品,就献给郭子兴,如果得到赏赐,就分给士兵. 5. 待得秋来九月八,我花开时百花杀。 冲天香阵透长安,满城尽带黄金甲。 &lt;咏菊&gt;唐时的黄巢落榜之后题于长安城门前。 6. 百花发时我不发,我若发时都吓杀. 要与西风战一场,遍身穿就黄金甲. ---朱元璋 7.一个人要显示自己的力量,从来都不是考暴力,挑战这一准则的人必然会被历史从强者的行列中淘汰,历来如此.8.徐寿辉,出生年月不详(死期到时很精确) 9.徐寿辉蒙了,他不是没有想过这一天的到来,但当他到来时,还是那么残酷. 10.在实际决策中,不受他人,特别是多数人意见的影响是很困难的,当许多人众口一词时,很多人都会从大流,甚至改变自己原来的看法,而朱元璋用他的的智慧告诉了人们,真理往往是站在少数人一边的. 朱元璋对他的谋士们说,你们的看法是有道理的,但是你们没有看到问题的关键:张士诚的特点是器小,陈友谅的特点是志骄;器小无远见,志骄好生事.如果我进攻陈友谅,张士诚必然不会救他,而进攻张士诚,陈友谅就一定会动员全国兵力来救,我就要两线作战,到时候就难说了. 精彩!真精彩! 如此之见识,此人不去天下,何人取. 11.有谋事说,应该先攻下太平,然后以太平为屏障与陈友谅决战. 又有谋士说,应该趁陈友谅立足不稳,马上出击与其决战,击敌半渡,可收全功.我们客观的来看,这两种注意似乎都不错,提出谋略的人也是很有见识的,但真的行得通吗? 朱元璋再度表现出了他的军事天才,这种天分将在今后的军事生涯中不断帮助他. 它分析道,先攻太平是不行的,因为太平城坚固,不保证能一定攻下来,即使攻下来以后,也无法在短时间内守住,陈友谅一定会一鼓作气攻克太平继而攻击应天,而那时主力部队已经即为疲劳,根本受不住应天.主动出击决战也是不可取的,因为舍弃坚城不守,贸然出击,一旦未能与敌军进行决战或是战败,整个战局就会陷入被动. 最后,他说出了自己的见解,用手指了指应天城外的龙湾:”就在这里”. 12.在通往胜利之门的路上,你会见到很多钥匙,这些钥匙有的古香古色,有的金光闪闪,但只有一把能打开那扇门. 在进行决策时,会有很多人在你耳边提出他们自己的意见,将他们手中的钥匙交给你,让你去选择,但这个游戏最残酷的地方在于:你只有一次尝试的机会.如果失败了,你将失去一切. 在战役实施中,只有一个时机是最合适的,能抓住这个时机的,既是天才—拿破仑 13. 杀尽江南百万兵,腰间宝剑血尤腥. 老僧不识英雄汉,只管哓哓问姓名. 14.陈友谅之所以失败,只是因为一个很简单的道理:最强大的武器,不是军队的人数,不是强大的舰队,而是人心. 15.陈友谅第一个进攻的目标正是洪都. 后人一直为陈友谅的这个决定不解,未什么不直接攻击应天呢?那样朱元璋将腹背受敌,不堪一击,陈友谅为什么现成的便宜不捡呢? 这四会是一个很难解释的问题,但我相信,在陈友谅那里,这个问题很好解释.陈友谅的性格弱点注定了他一定会进攻洪都. 他是一个心狠手黑的人,一直在欺骗和背叛中生活,对这些东西并不陌生,洪都的投敌对他而言并不是什么意想不到的事情. 但从心理学上说,像他这样的人最忌讳的就是被人背叛,对一个人而言,他最厌恶的往往就是自己所擅长的. 属于我的东西,我一定要拿回来. 攻下洪都,就可以教训那些背叛我的人,让他们懂得对我陈友谅有绝对忠诚. 只许我付天下人,不许天下人负我,这是人类的通病. 朱文正的各种轶事自然也传到了陈友谅的耳朵里,这对他而言又是一个极大的鼓励. 攻下洪都,易如反掌! 但他似乎少考考虑了一点:以朱元璋之精明,不可能不知道朱文正的言行,怎么会把如此重要的位置交给一个这样的人? 16.按照均是天赋和功劳,朱文正大致可以排在将领中的第五位,这并不是因为他不够优秀,而是因为他前面的那四个人都是无法超越的. 17.当面对强大的敌人时,人们的第一反应往往是出生的牛犊不怕虎,先上去拼一拼,不行再说.这个行为的错误之处在于,牛犊并非不怕虎,而是因为它不知道虎的可怕. 18.越接近对方的水平,就越了解对方,就会越来越畏惧.当他的畏惧达到极点的时候,也就是它能与对手匹敌的时候. 19.以颤抖之身追赶,以敬畏之心挑战.战胜陈友谅,即为天下之主. 马渡江头苜蓿香,片云片雨渡潇湘. 东风吹醒英雄梦,不是咸阳是洛阳. 20.赌局一旦开始,无论你赢或者是输,都不能走,赌局会继续进行,知道其中一个人输掉一切,才会结束. 21.其人格之无耻,行为之卑略,脸皮之厚度,后人难以匹敌. 22.醉卧沙场君莫笑,古来征战几人还. 23.兵法之所以奇妙，关键在于一个变字。所谓善出奇者，无穷如天地，不竭如江海！战场是一个瞬息万变的世界，决断只在一线之间，进攻还是防守，前进还是退却，都要你拿主意。在你身边也许有一大群参谋，但他们往往并不站在真理一边，决断的还是你。如果参谋比你高明，为什么要你当主帅？ 24.在下曾读过一些兵书，随便聊： 在成为名将的道路上,我们要经历六个坎坷,让我们以六个年级来标明它们,只有战胜眼前的坎坷,才能升入下一个年级。当然,有些天才同学不需要经过这六个年级,生下来就会打仗,这样的人也是有的,不过极少,我们可以忽略。 好了,名将学校开学了。第一个年级要学习的是军事理论。所有想成为名将的人,必须要学习一些经典的理论知识,包括《孙子兵法》《吴子兵法》等等,只有在积累了大量的理论知识后,你才能跨入下一个年级。但这个年级有一个很特殊的规定,因为有些同学家里穷,买不起书本,所以他们只能在实战中去学习这些理论。他们之中的优秀代表就是李云龙同学。 穷人家的孩子早当家,实在没有说错的,这些在实战中学习理论的同学将可以跳过第二个程序,直接进入第三个程序。 我们还是和大多数同学一起,来看看第二个年级要学习些什么。第二个年级学习的内容是实战。这是极为重要的,那些理论学习的优秀者如果不能过这一关,他们就将被授予一个光荣的称号——纸上谈兵。这个称号的第一个获得者是赵括同学,授予者是二年级的年级主任赵奢。 我们来解释一下为什么实战如此重要。这是因为虽然军事理论都是高年级学长们的经验总结,但由于他们写这些东西的时候,情况和现状是不完全一样的,在实战中,如果照搬是要吃大亏的。赵括同学就是没有学好,才不能毕业的。 作为一个学员,想成为名将,一般都是从小兵干起,当然高干子弟除外,比如赵括同学,由于年级主任赵奢是他父亲,所以他一开始就是大将,这是不妥当的。 因为只有战场才能让一个人成为真正的名将,他必须亲手持刀去追击敌人,见识战场的惨烈,明白人被刀砍是要死的,了解你不杀我、我就杀你这条战场上永不过时的真理,知道所谓打仗就是以性命相搏,他们才会明白什么是战场、什么是实战。 大多数学员会在这一关被淘汰,他们会改行,一生当一个军事票友,这对他们来说并不见得是一件坏事。 而留存下来的那些学员,在残酷的实战中逐渐了解了战争的规律,开始真正走上名将之路。 好了,我们带领剩下的学员来到三年级,三年级要学习的是冷酷。 成为一个名将,就必须和仁慈、温和之类的名词说再见。他必须心如铁石、冷酷无情,当然历史上也有很多以仁出名的儒将,但请大家注意,他们的仁是对士兵和老百姓而言的,对敌人他们比谁都冷酷。所谓仁不带兵、义不行贾,冷酷不是残忍,不是杀戮无辜的老百姓,而是坚忍。比如你的一个很好的朋友触犯了军纪,但你为了执行军纪,一定要杀了他,只有这样,你才能控制军队,即使他是你最要好的朋友,甚至是你的亲人,你也要这样做。 这才是真正的冷酷。 学员们将在战场上学会冷酷,他们可能都是善良的年轻人,平时从不与人争吵。但当他们走上战场,亲眼看到自己的同乡和战友被敌人杀死,或者身负重伤在地上痛苦地呻吟,他们会被愤怒和痛苦所鼓动,毫不留情地杀死一切与自己敌对的人,给地上的伤兵补上一刀,然后一个人在尸体旁边喃喃自语。就在这地狱一般的环境中,他们变了。 从杀鸡都怕见血到敌人的脑浆和鲜血溅到身上浑然不知,从温文尔雅到冷酷无情,他们在残酷的环境中毕业了,不合格者将被淘汰,而那些心如坚石的人将进入四年级的学习,他们离成为名将越来越近。 四年级要学习的是理智。这也是极为重要的一个环节,我们作为普通人,生活中会被许多事情左右自己的情绪,比如买彩票中个二等奖几百块,你也会高兴半天,要是炒股票赚了大钱,就更不用说了。那么如果你玩的游戏是以人命为赌注呢？你会有何反应？ 当你在极度紧张的环境中与敌人僵持了很长时间,突然敌人退却了,你能遏制住心中的激动,先判断形势再去追击吗？当你抵挡不住敌人的进攻、全军即将崩溃时,你能及时冷静下来,发现敌人的弱点吗？ 是的,这太难了。我们都是凡人,都有感情,容易激动,而我们的学员们就必须保持冷静和理智,在任何时候都不被感情左右,就如同赛车一样,赛车固然激情四射,车手却必须保持绝对的冷静。 这就是四年级学员要做到的,能过这一关的人,已经很少了,剩下的精英们,我们继续前进！ 五年级是最重要的一个年级,在这个年级里,学员们要学习的是判断。 这是名将的重要特征,不需要理由,不需要依据,你能依靠的就是你自己的判断。你要明白的是,你所掌握的是无数士兵的生命,而所有的人都等着你拿主意。 小兵只管打仗,遇到问题,他会问伍长,伍长会问百户,百户会问千户,千户问指挥,你就是指挥,你还能去问谁？！ 在士兵的眼中,你就是上帝,就是主宰世界的神！他们能否活下来就看你的了！ 兵法之所以奇妙,关键在于一个变字。所谓善出奇者,无穷如天地,不竭如江海！战场是一个瞬息万变的世界,决断只在一线之间,进攻还是防守,前进还是退却,都要你拿主意。在你身边也许有一大群参谋,但他们往往并不站在真理一边,决断的还是你。如果参谋比你高明,为什么要你当主帅？！ 如果你能从那变化莫测的世界中,发现其中的奥妙,并就此做出正确的决断,那么恭喜你,你已经具备了名将最主要的素质。但是还有一关是你必须通过的,只有过了这一关,你才是真正的名将。 现在我们来到最后一个年级,这个年级我们要学习的是坚强。 从某种意义上说,这是非常重要的一个学习内容。所谓胜败兵家常事,不过安慰自己而已,打了败仗,死几万人,你能承受这样的心理压力吗？你怎么去面对那些士兵的家人？怎么有脸去见将指挥权交给你的上级？那是几万条人命,不是几万只鸡！ 然而你的选择只能是坚强,即使你屡战屡败,但必须屡败屡战！当你数次败在同一个人手下时,你就会畏惧这个人,所谓的恐某症就是这么来的,即使你有着杰出的军事才能,不能战胜自己的软弱,依然无法成为名将。 而那些最优秀的人能够从失败中爬起来,去挑战那个多次战胜自己的人,这就叫做坚强。 当你具备了以上所有条件后,你就成为了真正的名将,但还有一点,是你必须具备的,那就是运气。 说起来似乎有点滑稽,这也是很重要的一个因素,没准就在你万事俱备、准备大展身手时,一支冷箭射来,就此死掉,那才是比窦娥还冤,你的一切抱负和能力都无法展现了。战史上只会这样记载,某年某月某日,某某人在战场上被不知名小兵射死,其人具体情况不详。 所以名将之路是一条艰苦的道路,非大智大勇、大吉大利之人不能为。 故兵无常势,水无常形,能因敌变化而取胜者,谓之神。 在这变化无穷的战场上,要想成为真正的军神,你必须在一次次的残杀中幸存下来,看着周围的人死去,忍受无尽的痛苦,在战争中学习战争,努力获取那不为人知的奥秘和规律,经历无数次失败,有勇气从无数士兵的尸体上站立起来,去打败对手。 这才是真正的名将之路,一条痛苦、孤独、血腥的道路,在这条路上,能信任和依靠的人只有你自己。但只要你走到终点,光荣和胜利就会在那里等待着你。 无论是徐达、常遇春、王保保还是后来的戚继光、袁崇焕都是这样的名将,他们就是这样成长起来的。他们完全有理由为自己的成长经历而骄傲和自豪。 所以当不成名将的各位学员,你们完全不必为此而悲伤失望,因为这工作不是一般人能干的,甚至可以说,不是人能干的。诸位普通学员,还是回去做老百姓吧,那才是快乐的生活。 25.其实只要仔细想想,就会发现这个问题并不是那么难以解释。朱元璋是一个乡土观念很重的人,李善长是他的老乡,而且多年来只在幕后工作,从不抢风头,只知埋头干活,这样的一个人朱元璋是很放心的。相对的,刘基是一个外乡人；更重要的是,刘基对事情的判断比他还要准确！ 从龙湾之战到救援安丰,朱元璋想到的,刘基也想到了；朱元璋没有想到的,刘基还是想到了。 换了你是皇帝,会容许这样的一个人在身边吗？ 26.谈话中的考验 这一天,朱元璋单独找刘基谈话,初始比较和谐,双方以拉家常开始了这次谈话,就在气氛渐趋融洽时,朱元璋突然变换了脸色,以严肃的口气问刘基,如果换掉李善长,谁可以做丞相。 刘基十分警觉,马上说道,这要陛下决定。 朱元璋的脸色这才好看了点,他接着问：“你觉得杨宪如何？” 这又是一个陷阱,朱元璋明知杨宪是刘基的人,所以先提出此人来试探刘基。 刘基现在才明白,这是一次异常凶险的谈话,如果稍有不慎,就会人头落地！他马上回答：“杨宪有丞相的才能,但没有丞相的气量,不可以。” 但考验还远远没有结束,朱元璋接着问：“汪广洋如何？” 这是第二个陷阱,汪广洋并不是淮西集团的成员,朱元璋怀疑他和刘基勾结,所以第二个提出他 刘基见招拆招,回答道：“此人很浅薄,不可以。” 朱元璋佩服地看了刘基一眼,这是个精明的人啊。 他说出了第三个人选：“胡惟庸如何？” 刘基松了口气,说出了他一生中最准确的判断：“胡惟庸现在是一头小牛,但将来他一定会摆脱牛犁的束缚！” 说完这句话,刘基又松了口气,他知道考验已经过去了,但他错了,下一个问题才是致命的。 朱元璋终于亮出了杀招,他用意味深长的口气说道：“我的相位看来只有先生能担当了。” 大凡在极度紧张后,人们的思想会放松下来,刘基也不例外,他终于犯了一次错误,这次错误却是致命的。 他没有细想,回答朱元璋： “我并非不知道自己可以,但我这个人嫉恶如仇,皇上还是慢慢挑选吧。” 这句话说得非常不合适,自居丞相之才不说,还说出所谓嫉恶如仇的话,如刘基所说,谁是恶呢？ 刘基的昏劲还没有过去,又加上了一句话： “现在的这些人,在我看来并没有合适的。”（目前诸人,臣诚未见其可也。） 朱元璋就此与刘基决裂。 27.但很多人都知道,胡惟庸和刘基有仇,朱元璋也知道,却派他去探望刘基。而刘基这样有影响的人,胡惟庸是不敢随便动手的,不然也不会让刘基在他眼皮底下逍遥五年,他很有可能是得到了朱元璋的默许。 无论此事是否朱元璋指使,但毫无疑问的是,刘基之死朱元璋是负有责任的。 28.历史上著名的郑庄公,一直不为其母亲所喜爱,他的弟弟也仗着母亲的溺爱,向他提出种种不合理的要求,而郑庄公总是满足他,直到最后,他的弟弟企图谋反,郑庄公才出兵将之灭掉。 后人往往以为郑庄公仁至义尽,传为美谈,可是也有人指出,郑庄公是真正的伪君子,是想要他弟弟的命,才纵容他的不法。 当我们深刻理解了这个故事后,对朱元璋的这种反常举动就会有一个清晰的结论——这是一个阴谋。 这个阴谋在不同的语言方式中有不同的说法,成语是“欲擒故纵”,学名叫“捧杀”,俗语是“将欲取之,必先与之”,用小兵张嘎的话来说是“别看今天闹得欢,当心将来拉清单”。 但我们还有一个疑问,对付一个小小的胡惟庸,朱元璋需要动这么多脑筋,要忍耐他七年之久吗？ 不错,当我们仔细地分析历史,就会发现,胡惟庸绝不是朱元璋的真正目标,朱元璋要毁灭的是胡惟庸背后的那个庞然大物。 朱元璋甘愿忍受胡惟庸的专横,让这个跳梁小丑尽情表演,套用围棋里的一句话来形容就是“不为小利,必有大谋”,他经历如此多的磨难,陈友谅、张士诚、王保保这些当世豪杰都不是他的对手,何况小小的胡惟庸！ 他这样委屈自己,只因他的目标对手太过强大,这个对手并不是李善长,也不是淮西集团,而是胡惟庸身后那延续了上千年的丞相制度。 自从朱元璋当皇帝后,他一直都觉得这个制度过于限制他的权力,他一向认为天下是靠他自己的能力争来的,偏偏有人要来分权,真是岂有此理！ 29.我捧得起你,就踩得倒你！ 30.朱元璋是这样走到这一步的：从茅草屋的风雨到皇觉寺的孤灯,从滁州的刀光剑影到鄱阳湖的烽火连天,他从千军万马中奔驰而出,自尸山血海里站立起来；他经历过无数的磨难,忍受过无数的痛苦,他不畏惧所有的权威,不惧怕任何的敌人；一个个盖世枭雄在他面前倒下去,他见过的死人比胡惟庸见过的活人还多！ 胡惟庸终于明白了为什么李善长不愿意和朱元璋为敌,不是他没有野心,而是因为畏惧。 不用交手,胡惟庸已经明白,自己上错了擂台,他跟朱元璋根本不是一个重量级的选手。 31.值得注意的是,朱元璋在处死胡惟庸后仅一个月，就撤销了丞相这个延续上千年的职位，取消了中书省的设置，安排机构分流人员。如此大动作，却干得雷厉风行、干净利落，这让我们有理由怀疑他是早有准备的，就如同《水浒传》的宋江，晁盖死后无论如何不肯继位，一旦“勉为其难”答应了，立刻就能组织大型庆典。 32.丞相是怎样炼成的。 有人曾对我说，知道历史表象就好，无需知道历史本质。把故事讲明白就行了，至于原因，是无关紧要的。 是的，故事是有趣的，原因是枯燥的。但枯燥的，更有价值。 对很多人而言，诸葛亮和刘伯温是两个神人，他们往往能够预见到事情的发展方向，即使住在农村里，一年进不了几次城，也能够知道天下大势，并能够准确预测未来的走向，如诸葛亮之与“隆中对”，刘伯温之与安丰之战，坐在炕上，盘着腿就能预知未来。 因为他们知道故事，而且了解原因。所以，他们才无比强大。 这个世界上，最让人畏惧的就是未知，如果人人都知道自己的未来，他们就不会再害怕。但在时间机器没有发明之前，我们还是只能向诸葛亮和刘伯温同志学习，比如当我们知道了地主怎样炼成的规律后，下次当你看到史书上的某位农民领袖起义，你不需要再往下看，只要这人没有在起义过程中被人干掉，你就能肯定，下一个王朝中必然多了一个地主。这就是内涵的力量，无比强大的力量。 33.在我们的历史和生活中，有着很多非常奇妙的规则，这些规则看不见、摸不着，却始终起着作用。比如著名的黄金分割，以黄金分割比例确定的图案是最美丽的，划分的结构是最合理的。很多艺术高超的二胡演奏家发现，在胡弦的某个位置拉出的音色非常优美，经过验证，那个位置正是胡弦的黄金分割位。 这些规则实在是太神奇了，如果你依照这些规则去做，你就能够获得事半功倍的效果。而如果你违反这些规则，你将受到它的惩罚。 在历史中也存在神奇的规则，这些规则在冥冥中操纵着一切，没有人可以抗拒它。 在这场拔河中，历史规则也起着作用。一千余年来，王侯将相们根据这一规则确定了自己的位置，而朱元璋无视这一规则，他认为自己能够彻底消灭丞相制度。从某种意义上来说，他确实做到了。 34.在今天我们可以说她(马皇后)是一位伟大的女性:生如夏花，逝如冬雪； 35.蓝玉是一个优秀的将领，却在获得成功之后做出如此多不法的事情，似乎是难以理解的。但其实只要联系我们前面提到过的纳哈出投降事件，就能合理地解释蓝玉的行为。 从宴请纳哈出时的傲慢到喜峰关的骄狂我们可以给蓝玉下一个结论那就是：这是个粗人。 所谓粗人不是指他没有文化或是行为粗鲁，而是指他的行为欠考虑，为人处事不通人情，属于那种想了就干、干了再想的人。其实他的性格一向如此，就算不在这件事上犯错误迟早也会在那件事上捅娄子。 性格决定命运，而关键问题在于蓝玉的命运并不完全掌握在他自己的手中，在很大程度上他的生死只取决于朱元璋的容忍和耐心，而朱元璋并不是个有耐心的人。 36.其实你也可以想到，杀掉一个小小的蓝玉无须牵连这么多的人。而且蓝玉并不是胡惟庸，他的同党并不多，朱元璋却不断地把很多无辜的人当做蓝玉的同党杀掉，这就有点意思了。 在这一举动背后,隐藏着真实的目的. 很多看上去不相干的事情，其实是有着紧密的联系的。在那枯燥的历史资料里面往往隐藏着事实的真相。 37.虽然历史已经过去了几百年，黄沙早已经将那些故往埋葬，但我们还是应该从那些故纸堆中找出真相，还朱标父子一个公道。 因为迟到的公道仍然是公道。 38.事实证明，在这场斗争中，朱元璋失败了。 原因何在呢？答案看起来似乎深不可测，其实很简单： 因为朱元璋只是历史的执行者，他并不是历史的创造者。 即使没有朱元璋，也会有李元璋、王元璋来完成历史的使命，推翻旧的王朝，建立新的帝国。历史是一个好客的主人，但却从不容许客人取代它的位置。历史也从来就不是一个人或是几个人可以支配创造的。所谓时势造英雄，实乃至理名言。 真正支配历史的人，不是朱元璋，是稻田里辛勤劳作的老农，是官道上来往的商贾，是朝堂上进言的官员，是孤灯下苦读的学子。 他们中的大多数人注定默默无闻，都无法在历史上留下自己的名字，但他们才是历史真正的主人。 从古至今，从无例外。 39.自古有云：善用刀剑者，死于刀剑下。 而对于这个婴孩而言，生于战火，死于征途，似乎就是他一生的宿命。 绝对不要做你的敌人希望你做的事情，原因很简单，因为敌人希望你这样做。 ——拿破仑 41.朱棣，是一个可怕的人。 可怕之处不在于他俘获了多少敌人，而在于他在这次军事行动中所表现出来的素质和心智。 他率领数万士兵远涉千里，冒雪顶风，历经千难万苦才找到敌人，这就好比寻宝片中，一群海盗费心劳力，疲惫不堪，终于找到了宝藏。相信所有的人在那个环境下都会极度兴奋。 就要发财了！命运即将改变！ 当时的朱棣也是如此，他千辛万苦才找到了敌人，而此时的敌人也不堪一击，只要下个简单的命令，敌人就会被击溃，然而他却没有这样做。这就好比海盗们找到了藏有宝藏的海岛，打开了箱子，看见了无数的金银珠宝，头领却突然发话：大家回家吧，把财宝留在这里，明年再来取！ 如果有哪个不开窍的头目敢这样说，只怕早就被部下收拾了。 简单的占有是小聪明，暂时的放弃才是大智慧。 朱棣为了这一刻等待了很久，眼看胜利就在眼前，自己的能力终于得到了展现的机会，父亲也会另眼相看，这是极大的诱惑。 然而他放弃了，虽然是暂时的。 他没有理会磨刀霍霍的部下的催促，没有下令去砍杀那些目瞪口呆的元军。他暂时搁置了自己将要获得的荣耀。 这需要何等的忍耐力和抑制力！ 这才是朱棣真正的可怕之处：一个能够忍耐的人，一个能够压抑自己欲望的人。 不要小看这个远征中的插曲，如果你进行认真仔细的分析，就可以从这件事情中获知朱棣的性格秘密。 在史料中，关于朱棣存在着两种完全不同的记载，也代表着他的两种面孔：一种是仁慈和善，他经常和属地的老百姓在一起，为他们主持正义，爱民如子；另一种是残暴嗜杀，用油锅烹死不服从他的大臣，灭杀他们所有的亲属。 这似乎是矛盾的，同一个人怎么会有这样截然不同的两种表现？然而这些都是史实。那么怎么解释这个问题呢？ 答案很简单：朱棣有着两副不同的面孔不是因为他有精神病或者双重人格，恰恰相反，他是一个头脑极其清醒的人。他很清楚自己在做些什么，这两副面孔绝不会同时出现，它们分别有不同的用途。 和善慈悲的面孔用来应付服从他的人，残暴凶狠的面孔用来对付他的敌人。 对于朱棣而言，残暴是一种手段，怀柔是另一种手段，使用什么样的手段是次要的，达到目的才是根本所在。 为了达到目的可以压抑自己的感情，为了达到目的可以勉强自己去做不愿意做的事，为了达到目的可以不择手段！ 42.人生最痛苦的地方不在于有一个悲惨的结局，而在于知道了结局却无法改变。如果说之前的朱棣只是抱怨，那么朱允炆继位后的朱棣就是真的准备图谋不轨了。用法律术语来说，这是一个从犯罪预想到犯罪预备的过程。 43.他告诉我们，坚强的意志和决心可以战胜一切困难。 他告诉我们，执著的信念和无畏的心灵才是最强大的武器。 当朱元璋回望自己几十年的峥嵘岁月，回望自己一手建立的强大国家时，他有充足的理由为之骄傲和自豪！ 我是朱元璋，是大明天下的缔造者！ 44.大家应该从朱元璋的话中吸取教训，一般领导提拔你之前总是要打压一下的，所谓磨炼就是这样来的，千万不要为此和领导闹意见，否则就真有可能一辈子压制下去了. 45.造反需要理由吗？需要，非常需要。在造反这项活动中，理由看上去无关紧要，但实际上，理由虽不是必需的，却也是必要的。 对朱棣而言更是如此，自己是藩王，不是贫农，造反的对象是经过法律认可的皇帝。无论从哪个方面来看，自己都是理亏的。所以找一个理由实在是很有必要的，即使骗不了别人，至少可以骗骗自己。 于是朱棣和道衍开始从浩如烟海的大明法条规定中寻找自己的依据，这有点类似今天法庭上开庭的律师翻阅法律条文，寻找法律漏洞。功夫不负有心人，他们终于找到了法律规则的漏洞，打了一个漂亮的擦边球。 朱元璋并非完全没有料到自己的儿子将来有可能会造孙子的反，他制定了一套极为复杂的规定，用来制约藩王，但为了防止所谓奸臣作乱，他又规定藩王在危急时刻可以起兵勤王，即所谓“朝无正臣，内有奸恶，则亲王训兵待命，天子密诏诸王，统领镇兵讨平之”。 但这个规定有一个关键之处，那就是需要天子密诏。而在朱棣和道衍看来，这个问题是不难解决的，他们充分发挥了自己厚黑学的本领，对这一点视而不见，公然宣称朝中有奸臣，要出兵“靖难”，清君侧。 更让人难以置信的是，他们居然还将这一套歪论写成奏折，公然上奏朝廷，向朝廷要人，摆出一副义愤填膺的模样，这就如同街上的地痞打了对方一个耳光，然后激动地询问肇事者的去向，并表示一定要为对方主持公道。 “靖难”理论的提出和发展充分说明朱棣已经熟练地掌握了权谋规则中的一条重要原理： 如果你喜欢别人的东西，就把它拿过来，辩护律师总是找得到的。 ——腓特烈二世原创 46.黄子澄又一次误判了形势，一个人做一件蠢事并不难，难的是一直做蠢事。只要回顾一下此人以往提出的各种天才意见，就会发现他确实完成了这个高难度的任务。如果此人后来不是尽忠而死，恐怕逃脱不了燕王间谍的嫌疑。 47.人生最痛苦的事情，莫过于不得不玩一场绝对不能输的游戏。 48.即使你的敌人无比强大，即使你没有好的应对方法，但只要你有敢于面对强敌的决心和勇气，你就会发现，奇迹是可以创造的。 49.决定战争胜负的并不一定是先进的武器和士兵的数量，而是人的决心和智慧. 50.失败算不了什么，希望的丧失才是最大的痛苦。 51.所谓气节这样东西，平日被很多人挂在嘴边，也经常被当做大棒来打别人，但真正的气节总是在危急关头表现出来的。而在这种时候，坚持气节的下场往往不会是鲜花和掌声。 只有那些真正的英雄，才能在面对屠刀时体现出自己的气节。 52.暴力不能解决一切，却可以解决你。 53.从历史中我们可以知道，宽容从来都不是软弱。","tags":[{"name":"历史","slug":"历史","permalink":"http://yoursite.com/tags/历史/"}]},{"title":"给你一个亿，你能干什么？","date":"2017-04-22T15:38:00.000Z","path":"2017/04/22/给你一个亿，你能干什么？/","text":"“我给你一个亿，你能干什么？”这句话像照妖镜，常常能把人问得张口结舌、面红耳赤，一时间江郎才尽、无言以对。 1.创业绝对不是钱的问题。 2.创业者必须是个创新者。 创业就是创新，不然的话人人都可以说：“你把钱给我吧，我也去开个‘国美’连锁大卖场吧，我也去珠海开发房地产吧，我也做一个YouTube、MySpace、《魔兽》、‘支付宝’、‘狗扑’、‘犹酷’、‘开膛网’吧……”没人敢这么说是因为人人明白忽悠至多只能骗些小钱，搞大钱是要凭真功夫的，真功夫就是创新、创新、创新！！！创业就是要创新，不玩点儿新名堂，VC怎么会对你感兴趣？没有点儿新花招，你怎么能够击败竞争对手而成为市场的宠儿？没有新产品、新服务、新模式、新用户体验，怎么会有消费者青睐你、掏腰包大把大把付你钱？当然，创业也未尝不是没有人去卖山寨机、去偷工减料把同类产品做得更烂卖得更便宜，去靠“让利”和“打折”作为自己抵挡竞争的武器……人生难得几回搏，一旦你走上了创业之路，一定要想好，十字路口，向东走还是向西走？ 人们常常误解“创新”，以为分析一下市场数据，就可以马上“创新”出产品去填补市场空缺；回头看了一下历史，就以为自己能够看清未来。所以常常有人以为：因为PC时代到来了，为了弥补市场的空缺，所以乔布斯发明了个人电脑，比尔-盖茨发明了Windows……错也错也，乔布斯发明苹果电脑完全是由着自己的兴致干一件自以为是充满刺激的事情，比尔-盖茨的Windows垄断了PC操作系统完全是因为“蓝色巨人”IBM在错误的时间做了一件错误的事情，昏头昏脑地送给了比尔-盖茨一个发大财的机缘。 其实，人类预测未来的能力很低。为什么世界上只有一个爱因斯坦？为什么苹果从树上落下来砸到那么多人脑袋上却只有牛顿想到了“万有引力”？为什么千百个山寨机中只有一个iPod、一个iPhone鹤立鸡群？ 直截了当问你吧，你能不能告诉我，10年以后你如何听音乐？你会不会还继续使用你那台老掉了牙的iPod？iPod到那时应不应该被颠覆掉？如果你能够看到未来，能想出将会取代iPod的新玩意儿，那么，全世界的VC都会抢着过来砸钱给你，让你去把乔布斯这小子给灭了，让他到时候也来跟风造山寨机。 创新是个神秘的过程，谁要是拍胸脯说自己知道如何创新，那是呓语。。。。。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"什么是营销?","date":"2017-04-14T14:35:35.000Z","path":"2017/04/14/什么是营销/","text":"何谓营销?营销是作为思维的存在，而非具体学科.你所学所知的“市场营销”，其实是“企业营销”，冰山一角而已。 那么什么是营销？ 营销就是A为B创造对方想要的价值，建立与维持关系，以获得回报的思维过程. 思维过程表达式：STP+4P+CRM A与B的等量代换能生一切法，真实不虚. ###先说企业营销 把“企业”代入A，把“消费者”代入B，我们可以得到这样一个定义：企业营销就是企业为消费者创造对方想要的价值，建立与维持关系，以获得回报的过程。是不是和科特勒的定义几乎一模一样？此处结合过程表达式展开说企业营销，毕竟社会公认营销就是企业营销。 企业营销过程就是： 1.STP:企业通过消费者洞察与市场调查，了解消费者有哪几类（S市场细分），自己最有优势的是哪类消费者（T目标市场选择），自己要在这类消费者大脑中占据“最”什么或“第一”什么的位置（P定位）。 2.4P:完成STP之后，企业以独占目标消费者大脑中的目标位置为出发点与目标为消费者制造产品价值与塑造品牌价值（4P之产品与价格）、提供产品与品牌价值（4P之渠道）、传播产品价值与品牌价值（4P之宣传，特别说明国内多数市场营销教科书将4P中的“Promotion”翻译为“促销”与“销售促进”都是极其脑残的，因为促销本身是Promotion中的一个组成部分，而销售促进则不包含传播品牌价值，都是云遮雾绕的译法）。 3.CRM:做好上述价值创造工作，我们就可以通过客户关系管理（CRM）与内外部消费者建立并维持关系，并持续获得产品利润与品牌利润的回报了。 企业营销就是这样一个营销思维过程。虽然企业营销总被当成营销，但企业营销绝不是营销的所有。 那么，何还谓营销？ ###又如，恋爱 把“恋爱中的一方”代入A，把“恋爱中的另一方”代入B，我们可以得到这样一个定义：恋爱就是恋爱中的一方为恋爱中的另一方创造对方想要的价值，建立与维持关系，以获得回报的过程。 知道怎么恋爱了吗？若不明确，就把“你”代入A，把“小妞”代入B，恋爱就是你为小妞创造对方想要的价值，建立与维持关系，以获得回报的过程。过程表达式：知道小妞大体有几种类型，对于自己最有优势搞定的是哪类小妞，以及自己在选中类型小妞的大脑中独占什么什么样的Mr.Right标准；按对方心中Mr.Right的标准打造自己，若即若离但总在对方需要的时候出现，用一切方法让她确信你就是她的近在眼前的Mr.Right；建立并维持如胶似漆的恋爱关系，然后一晚上、一段时间或一辈子活活美死去吧。恋爱就是这样一个营销思维过程…… 复次，何又谓营销？ ###又如，职业生涯 把“员工”代入A，把“老板”代入B，我们可以得到这样一个定义：职业生涯就是员工为老板创造对方想要的价值，建立与维持关系，以获得回报的过程。 过程表达式：知道老板有哪几类，自己最适合的老板的是哪类，自己要成为该类老板心中什么岗位不可或缺的人才；通过努力使自己符合该类老板心中该岗位不可或缺的人才的标准，为公司持续贡献价值，并让老板耳闻目染你的价值与贡献；建立并维持相互忠诚的雇佣关系，老板离不开你之后就可以获得提薪或升职了。职业生涯就是这样一个营销思维过程…… 然后，何复谓营销？ ###甚至，人生 把“自己”代入A，把“生活”代入B，我们可以得到这样一个定义：人生就是自己为生活创造生活想要的价值，建立与维持关系，以获得回报的过程。 过程表达式：知道世上有什么样的生活，自己最适合什么样的生活，自己要在选择的生活中活出什么样的精彩；学习如何把自己选择的生活过得精彩，之后将生活过得精彩，让人生无憾所选择的生活；建立与维持自己与所选生活的各种微妙平衡，让自己可以始终享受所选生活给你的满足。人生也不过是这样一个营销思维过程…… 问：何谓营销。答：营销作为思维无所不在，何不谓曰营销？只要你用营销思维观想世界。 (原文链接：https://www.zhihu.com/question/20047841/answer/13799890)","tags":[{"name":"营销","slug":"营销","permalink":"http://yoursite.com/tags/营销/"}]},{"title":"产品缺点变卖点","date":"2017-04-10T14:54:37.000Z","path":"2017/04/10/产品缺点变卖点/","text":"有时候，商品的缺点也能变成卖点，关键看你如何引导！ 有一淘宝店在网上卖键盘膜，老是收到差评，纷纷指责键盘膜太薄了，说店家偷工减料，以次充好。店家临机一动，在标题和主图上加上了：超薄型!. 从此以后,好评连连.","tags":[{"name":"营销","slug":"营销","permalink":"http://yoursite.com/tags/营销/"}]},{"title":"《穷查理宝典》","date":"2017-04-10T06:42:02.000Z","path":"2017/04/10/《穷查理宝典》/","text":"《穷查理宝典》收录了查理过去20年来主要的公开演讲。除简单而权威的查理传略外，其后的《芒格的生活、学习和决策方法》以及《芒格主义：查理的即席谈话》整理了芒格最精华的思维与决策方式和以往在伯克希尔·哈撒韦公司和西科金融公司年会上犀利——和幽默——的评论。 而最后最珍贵的十一篇讲稿则全面展现了这个传奇人物的聪明才智。贯穿全书的是芒格展示出来的聪慧、机智，其令人敬服的价值观和深不可测的修辞天赋。他拥有百科全书式的知识，所以从古代的雄辩家，到18、19世纪的欧洲文豪，再到当代的流行文化偶像，这些人的名言他都能信手拈来，并用这些来强调终身学习和保持求知欲望的好处。 1.生活 如果我们在生活中唯一的成功就是通过买股票发财，那么这是一种失败的生活。成功的投资只是我们小心谋划、专注行事的生活方式的副产品。我们要能够比其他人更快更准确地分析出任何种类的交易，能够在60秒内找出令人信服的弱点。但是，生活不仅仅是精明地积累财富。我们要追求人生幸福，我们为此可以采取逆向思考的方式：如果要明白人生如何才能得到幸福，首先研究人生如何才能变得痛苦；研究企业如何做强做大，首先研究企业如何倒掉。生活上的大多数成功来自于你应该知道避免哪些事情（死亡、糟糕的婚姻艾滋病、吸毒）。培养良好的行李习惯，避免邪恶之人，尤其是那些性感诱人的异性。在生活里面我们要拥有良好的客观态度、个性素质——自律、耐心、冷静、独立。当然，你这么做会让你有所孤立，但是如果你因为你的特立独行而在周围人中不受欢迎——那么你就随他们去吧。 对于生活，我们追求朴素，一切从简：我们赚钱，靠的是记住浅显的，而不是掌握深奥的。我们从来不试图成为非常聪明的人，而是持续地试图别变成蠢货，久而久之，我们这种人便能获得非常大的优势；我们并不自称是道德高尚的人，但至少有很多即便是合法的事情，也是我们不屑去做的（有性格的人才能拿着现金坐在那里什么事也不做，我能有几天，靠的是不去追逐平庸的机会。）；所以对于谎言，我们的办法很简单——说真话，将无需记住你的谎言——就这么简单；满足我们已经拥有的：在生活中减少物质需求——你不需要很多物质的商品来满足自己大量愚蠢的需求（这些需求自然会很快消失）；在生活中不断培养自己理想性格（投资性格）：毫不妥协的耐性、自律，自控——无论遭受多大的压力也不会动摇或者改变原则 当然，我们还要有自知之明：一方面我们不需要懂很多事情，“我没有足够的能力来回答这个问题”“在这个领域我没有能力给你任何特殊的见解”——当你不了解、也没有相关的才能时，不要害怕说出来，没有人期望你什么都懂。有些人总是很自信地回答他们其实并不了解的问题，我不喜欢跟他们在一起。在我看来，他们就像是那只乱跳舞的蜜蜂，只会把整个蜂窝搞得乱哄哄的，而另一方面，如何对付错误和那些改变赢面的新情况，也是你们必须掌握的知识之一。如果你不明白有舍才有得的道理，如果你以为鱼与熊掌可以见得，那么你就太傻了。生活有时候就像扑克游戏，有时候你们即使拿到一把非常喜欢的牌，但也必须学会放弃。 2.学习学习100种模型，它们能够给你带来特别大的力量。当几个模型联合起来，你就能得到lollapalooza效应——这是好几种力量共同作用于同一个方向，而且你的道德通常不仅仅是几种力量之和。在投资领域我将这个学习方法称之为“生态”投资法：完美地糅合来自各个传统学科的分析工具、方法公式，这些学科包括：历史、心理、生理、数学、工程、生物、物理、化学、统计、经济等。这个投资法的理论基础是：几乎每个系统都受到多种因素的影响，所以若要理解这样的系统，就必须熟练地运用来自不同学科的多元思维方式。你必须意识到——生活无非就是一个接一个的联系。所以你必须拥有各种模型，你必须弄清楚各种模型的相互关系以及它们的效应，你必须辨认出这些事情之间的关系。如果你把自己训练得更加客观，拥有更多学科的知识，那么你在考虑事物的时候，就能够超越那些比你聪明得多的人，我觉得这是很好玩的。再说了，那样还能赚到很多钱，何乐而不为呢？所以与其创立一种有漏洞的制度，还不如就不要赔偿了——就让生活艰辛一些。 争取掌握近100种模型和一些思维技巧，那并不是很难的事情。这么做的好处在于绝大多数人不会这么做——部分原因是他们接受了错误的教育。所以我们必须全面掌握各种主要模型，把它们当作一张检查清单。再强调一些：你们必须注意那些能够产生lollapalooza后果的多因素组合效应。 有关我们在学校的教育，我们必须要认识到其局限性。很多聪明人之所以会犯错，大概是他们没有掌握所有重要的模型，把它们当作检查清单，用来审视各种复杂系统的结果。我们不能依照你们教授传授的方法来学习。你们应该学习他们传授的一切，但你们还应该学习许多他们没有教的知识——因为这些教授们并没有正确地对待他们自己的学科。大多属于教授用一个假定来解决这个问题：“如果我不能用实验来证明它，它就是不存在的。”然而，他们的假定明显是愚蠢的，如果有的事情在生活中极为明显，但很难通过容易做的、可重复的学术实验得到证明，这些的讯菇犬就会忽略它。如果有些东西非常重要，但由于道德约束，你们无法完美而准确地证明它，那么你们也不应该把它当作是不存在的。你们必须经历而为，利用现有的证据去证明它。而在你学习了心理学之后，你也要注意：装备基本的心理学力量的技巧（也就是说当你知道该怎么做）之后，你们必须依据道德规范来调整自己的行为。并不是你们懂得如何操控人们之后，就可以随心所欲地去操控他们。如果你跨过了道德的界限，而你们试图操控的那个人因为也懂得心理学，所以明白你们的用意，那么他就会恨你们。 当然了，我们的脑子没有那么好使，很多时候我们的确很难记住一些东西，还好前辈们给我们留下了两样宝贝：图表和优秀的文学作品。前者可以弥补弥补我们天生不擅长处理数字的缺陷；而后者逼着我们需要略加思考才能理解——只有这样它对我们的影响会很深，我们会更牢固地记住它（如果你动脑筋才懂得某个道理，你就会更好地记住它）。 3.工作当我们年轻的时候，我们在工作中应该尽量做到以下三点，当然了同时满足他们几乎是不可能的，但你应该努力去尝试： 1）不兜售你自己不会购买的东西 2）不为你不尊敬和倾佩的人工作 3）只跟你喜欢的人同事 工作上我们常常会主动或被动地有保留地接受专业顾问的建议，这里给出一般的对策： 1）如果顾问提出的专业建议对他本身特别有利，你就应该特别害怕这些建议 2）在和顾问打交道时，学习和使用你的顾问所在行业的基本知识 3）复核、质疑或者更换你得到的建议，除非经过客观考虑之后这些建议看起来是合理的 随着时间流逝，我们在长大，而我们的人生在不同阶段会遇到不同的难题，非常棘手的难题。这时候有3点有助于应付这些困难： 1）期望别太高 2）拥有幽默感 3）让自己置身于朋友和家人的关爱之中 4）最重要的是，要适应生活的变化。如果世界没有改变，我们现在身上会有更多的缺陷。 4.投资所谓投资这种游戏就是比别人更好地对未来作出预测。你怎样才能够比别人做出更好的预测呢？一种方法是把你的种种尝试限制在自己能力许可的那些个领域当中，光有好几回是不够的，我们能看明白这个领域到底是什么，所以得在我们能看明白的领域出现定错价的机会。这种机会不会经常出现。相反，如果你花费力气想要预测未来的每一件事情，那你尝试去做的事情太多了。你将会因为缺乏限制而走向失败。投资之所以困难，是因为人们很容易看出来有些公司的业务比其他公司要好，但他们股票价格升得太高了，所以突然之间，到底应该购买哪只股票这个问题变得很难回答。所以我们要把投资局限在简单而且好理解的备选项目之内——关于投资，我们只有3个选项：可以投资（容易理解、有发展空间、能够在任何市场环境下生存的主流行业）、不能投资（大张旗鼓宣传“交易”和公开招股）、太难理解（高科技、制药）。 投资股市最大的风险其实并不是价格的上下起伏，而是你的投资未来会不会出现永久性的亏损。单纯的股价下跌不仅不是风险，简直就是机会。不然那里去找便宜的股票呢？有些人的个性天生就不适合投资，他们要么过于焦躁，要么缺乏耐心。我认为优秀的品性比大脑更重要，你必须严格控制那些非理性的情绪，你需要镇定、自律，对损失与不幸淡然处之，同样地也不能被狂喜冲昏头脑。只有当你具有较好的个性（主要是指你非常有耐心），拥有了足够的知识后，势必进行大规模进攻，然后就会慢慢学会游戏规则，部分通过实践，部分通过学习别人的经验。显而易见，你能从别人那儿获得的启发越多，你的情况就会越好。 要记住那些竭力鼓吹你去做什么事的经纪人，都是被别人支付佣金和酬金的，那些初涉这一行、什么都不懂的投资者不如先从指数基金入手，因为它们毕竟由公共机构管理，个人化的因素少一些。一个投资者应当掌握格雷厄姆的基本投资方法，并且对商业经营有深入的了解，你要树立一个观念：对任何价值进行量化，并比较不同价值载体之间的优劣，这需要非常复杂的知识架构。 5.思维模型原则思维模型原则（你必须把经验悬挂在头脑中的一个由许多思维模型组成的框架上）： 1）你必须拥有多元思维模型——因为如果你只能使用一两个，你将会扭曲现实。 2）这些模型必须来自各自不同的学科——因为你不可能在一个小小的院系里面发现人世间全部的智慧。 3）使用最可靠的思维模型 1.硬科学/工程学：特别是质量控制理论（基础是费马和帕斯卡的基础数学理论）。 2.生物学/生理学：因为我们大家毕竟在基因构造方面都是相同的。 3.心理学：懂得如何利用人性，让大脑以某种错误运转的人能够使你看到根本不存在的东西。重点掌握核心内容里的误判心理学，包括20个小原则。 4.微观经济学：不过他不是那么可靠，这种人类智慧要小心使用。 4）了解所使用模型的局限：这一点也可以用来操控和激励别人 世界上不存在不犯错误的学习或行事方式，只是我们可以通过学习，比其他人少犯一些错误——也能够在犯了错误之后，更快地纠正错误。但既要过上富足的生活又不犯很多错误是不可能的。实际上，生活之所以如此，是为了让你们能够处理错误。那些破产的人的通病是无法正确地处理心理否认","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"《牛奶可乐经济学》","date":"2017-04-10T06:35:57.000Z","path":"2017/04/10/《牛奶可乐经济学》/","text":"《牛奶可乐经济学》原名叫做《经济博物学家：破解日常生活的密码》。作者罗伯特•弗兰克教授著有最畅销的中级经济学教材《微观经济学和行为》，他教的微观经济学入门课程每年都会吸引6000多名学生，他布置过这样的书面作业：“利用经济学原理，探讨你亲身观察到的事件或行为模式中的有趣题。”而且不要长篇大论，字数限制在500字以内。“文章里面不要掺杂复杂的技术，要假设你是在给一个从没上过经济学课的亲戚讲故事。” 《牛奶可乐经济学》就是一本这样的故事合集。问题千奇百怪，分析工具却相当简单——成本效益原则。当一个行动带来的收益大于成本时，人们就会采取行动。这是绝大多数举动的根源。 比如，为什么最畅销的书常常打折销售，而最热门的电影却不打折？因为对电影院来说，最稀缺的资源不是电影本身，而是座位。大受欢迎的电影即使不打折也会满座，出于收益最大化的考虑，电影院有理由不给票价打折。但是书不一样，如果预见到哪些产品更热门，卖家往往可以提前准备好充足的库存。卖家给书打折以促进销量，是更有利的做法。为什么机票现卖价格更高，而演出门票现买却更便宜？因为航空业主管们发现，出公差的商务人士更倾向于临时决定出行安排，而他们往往是高收入者，要么很富裕，要么可报销，对价格并不敏感。而演出不一样，高收入者一般不愿意到最后一刻才买票，临时买票毕竟要面对不知道能不能买到、也不知道还有什么样的座位等不确定因素。事到临头才在售票口买票的，大多是对价格比较敏感的人。 为什么“维多利亚的秘密”要提供价值数百万美元的镶钻胸罩，虽说从来没人买过？因为镶钻胸罩显然是个很能够吸引眼球的新闻噱头，而且成本并没有想象中那么高，它的主要价值在于镶钻，而钻石很容易回收，可以重复使用。但是，它起到的作用却非常明显。它改变了人们对送礼物该花多少钱的参照系，把“别人花了几百万美元”的想法悄悄灌输到人们的意识里，于是，花几百美元买上一款高级胸罩就显得没那么荒谬了。 为什么男性立法者也赞成废除一夫多妻制呢？很多人觉得一夫多妻制对女人不利、对男人来说倒是件好事。其实，对于一部分男士来说，一夫多妻制的确是有利的，但是，多妻制会造成男女比例失衡，女性供应量持续短缺，不少男人完全结不上婚，男人面临的压力更大，所以，禁止多妻制的法律实际上充当了一种限制恶性竞争的协议，以免男人过得太辛苦。 为什么某企业奖励员工一辆豪华轿车，而不是等值的现金？经济学家有一个很有说服力的观点：最好的礼物，往往是我们想要但是又不舍得买的东西。被奖励，等与别人帮着自己做出了选择，自己可以开开心心享受奖品，又无需为自己的奢侈行为感到愧疚。 书中提出了100多个这样的问题，全部来自于日常生活经验，涉及产品设计、供求关系分析、公用品、人际关系、心理学、职场风云等等各个方面，作者说“这些生活中的问题不是公式和概念，它们并没有标准确切的答案，每个人都有可能给出更多更合理的解释。”这也许正是此书的魅力所在。人人都可以从经济学的角度来分析经济生活现象，我思故我在，人生因此充满乐趣。作为一个“从没上过经济学课的亲戚”，这种书让人读得真是高兴。独特的观察角度，如同一场美妙的智力探险，情趣盎然。不枝不蔓，一个圈子也不绕，尽量用最简单的方法来解决问题，没有高深的数学模型，成本效益原则，边际效益分析，机会成本分析……都是最基础的经济学概念。如同高手，无招胜有招，手中不需藏利器，拈花飞叶，皆可伤人，何必非要倚天剑、屠龙刀？ 所以，花点时间翻翻看这本书，应该是能赚到的吧？谨以此篇文章献给每一位热爱生活，热爱思考的朋友们!","tags":[{"name":"经济学","slug":"经济学","permalink":"http://yoursite.com/tags/经济学/"}]},{"title":"为什么要读书？","date":"2017-04-10T06:30:05.000Z","path":"2017/04/10/为什么要读书？/","text":"在我们的的生活中总是要有一些这样的人，当我们被困在了一个漆黑的山洞中，我们的粮食只能够吃有限天，面临着前方的未知和恐惧，以及资源的有限，我们不可能让每个人都去探寻出口，于是我们就把多数的粮食给了其中一些人，让他们去摸索出口，找到以后再回来带我们出去……我便是其中的一员，书籍就是我的粮食，时间是我的朋友。至于最终我会摸索到什么，别急，让时间告诉你…… 那么我们为什么要读书呢？首先我觉得我们读书是为了让我们更加了解这个世界，当你更加了解这个世界的时候，无论你身处何处你的内心都不会有丝毫的慌张和恐惧，因为你知道世界就是这个样子，它就在那里。其次，有时候读书它是一件没办法的事情啊，你不读书你就没法和一些有趣的人有思想的人交流，就好像不能见面就只好写信一样，书只是一个载体，人和人之间的关系才是这个世界的根本。“你现在的气质里藏着你读过的书和爱过的人”，爱过的人不是你能够决定的，但是如果你能选择自己想看的书，最终会让你慢慢成为自己想成为的人。 希望你看到这篇文章之后能够多去看一些好书,哪怕只是略读一下也好,说不定那一本就改变了你呢…","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"《明朝那些事》","date":"2017-04-10T06:24:31.000Z","path":"2017/04/10/《明朝那些事》有感/","text":"高中与《明朝那些事儿》擦肩而过，那时候我的我喜欢钱钟书，喜欢韩寒，喜欢李敖，喜欢鲁迅。 大一我一股脑的钻研商业，那时候我喜欢Jason Fried，我喜欢彼得·蒂尔，我喜欢罗伯特·弗兰克、布莱克·马斯特斯、贝索斯、李善有、乔布斯、吴晓波、罗振宇、罗永浩、马尔科姆·格拉德威尔、埃里克·施密特…… 现在大二虽然现在我的世界里更多的是郭霖、是刘末鹏、是Benjamin J. Evans、paul graham ……但是我仍旧在这一年之内将《明朝那些事儿》一书共七部通读了两遍。恩，历史可以很“好玩”。历史是一个非常狡猾的动物，它有很多话想讲但是它就是不告诉你，只有当你能“从字里面看出字来时”，你才能够理解什么是历史。第二次看完《明朝那些事》，我看到了痛苦，挣扎，悲伤，追悔莫及，我看到了“情绪”。为什么我们很多人不懂历史？《明朝那些事儿》的作者当年明月说：“是因为你不知道，那个是真实发生过的，历史从来就不是故事，它是真的，这就是历史的秘密”。 第二次读《明朝那些事儿》，短短的数天之间见证了无数人的一生，每当我翻过一页纸，我就知道很多人的一生就这样结束了，他们当中的一些人在历史没有任何记录，甚至当他们的战友发现他们的尸体的时候都不知道他叫什么名字，他们的一辈子可能就只有一句话，你能理解他们的痛苦吗？当你看到我说这句话的时候可能觉得没有什么，内心甚至不会泛起一丝涟漪，但是我要告诉你他们父母再也见不到他们的儿子，妻子没有了丈夫，孩子们永远的失去了父亲，好好的一个家就这样没了……如果这还不能给你一丝触动的话，那么你可以去看看《卢旺达饭店》，但是要记住，千万不要用电影的结果去掩盖历史给这部电影的用意本身。因为所有试图“用战术上勤奋来掩饰战略上的懒惰”的行为都是耍流氓。 如果你说我就是没感觉呢？好吧，来看这样一句话：“白起伐赵，杀人四十万”，这句话特别普通是吧？但是如果你把它化为一个场景，你就知道它很可怕，几十万人的性命，他们也有父母，也有妻子，就没了…… 王阳明，于谦，朱元璋，朱隶，朱瞻基，朱佑樘，徐达，常遇春，陈士诚，陈友谅，蓝玉，杨善，扬廷和，扬士奇，毛人凤，袁崇焕，徐介，唐伯虎，海瑞，张居正，王振，魏忠贤，严嵩，严世蕃，胡宗宪，申时行，俞大猷，戚继光，郑和……我穿过历史看到了他们的痛苦，他们的无奈，他们的悲伤，他们的孤独，他们的挣扎，他们的追悔莫及，他们的自以为是…… 回到正题，来说说我们为什么要看历史呢？有些人说我们之所以看历史是因为要以史为鉴，其实我不赞同这句话，即便我们将《明朝那些事儿》背的滚瓜烂熟，该犯的错我们还是要犯，该吃的亏我们还是要吃。我们之所以要读历史，仅仅是穿越了时空，和那个时代的人交了一个朋友，看看他们是怎样和那个时代相结合度过自己的一生的，然后来反观我们这个时代，思考我们应该度过怎样的一生。仅此而已！ 如果你想给自己一个爱上历史的机会，如果你想穿越历史去交一些朋友和他们谈谈心，如果你想对自己的人生有一个新的认知，那就是这本书了！","tags":[{"name":"历史","slug":"历史","permalink":"http://yoursite.com/tags/历史/"}]},{"title":"书读多了你会变成什么样?","date":"2017-04-10T06:15:11.000Z","path":"2017/04/10/书读多了你会变成什么样/","text":"如果你读的足够多，你会获得一种超凡的经历：感受人类知识的进步。 你会发现一个问题在这本书里是这个说法，而过了几年之后有人另写了一本书，引用更有力的证据，把整个结论给改变了。有时候你会赞同这个新结论，有时候你会反对。有时候你必须从几本书的几个不同的结论中判断哪个才是最靠谱的。有时候你会觉得他们说的都不对，只有你知道正确的答案，如果你到了这个层次，那么，恭喜你…你已经可以俯视他们，评判他们之间的高下了。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"成功如此","date":"2017-04-10T06:11:24.000Z","path":"2017/04/10/成功如此/","text":"其实成功有的时候就取决于信心，只要你特别相信一件事，然后就按照这个方向做，没准就能做成，尤其是今天的这个商业社会，每个人都有自己的一套商业理论，你只要在逻辑上自洽，都可能对，关键是你怎么做。 创业这件事，有这么一句话，我们不是判定了一个理论，然后去实践它，而是，我们先说出了一个理论，然后用创业的整个过程证明我说的是对的。所以信心这件事，本质上在成功路上就很重要。 信心不仅是我们通往成功的必由之路，它即使不成功，他可以让我们的内心充满了幸福感和安定感。","tags":[{"name":"貌似有知识","slug":"貌似有知识","permalink":"http://yoursite.com/tags/貌似有知识/"}]},{"title":"在现有格局上,向上走一步","date":"2017-04-10T06:08:36.000Z","path":"2017/04/10/在现有格局上-向上走一步/","text":"要能权衡好本末轻重，就得有“价值意识”，也就是要搞清楚“人生中到底想要什么，追求什么”. 一个人为自己的内心树立什么样的最高目标、设定什么样的价值尺度，反映了他的“格局”。 当我们面临人生中的中中选择时，如果我们拿出一点勇气，为自己设定更高的目标，那么我们就可以发现更多更好的选项，做出更加完美的决定。","tags":[{"name":"貌似有知识","slug":"貌似有知识","permalink":"http://yoursite.com/tags/貌似有知识/"}]},{"title":"具有心智独特性的人所具有的优势","date":"2017-04-09T14:04:22.000Z","path":"2017/04/09/具有心智独特性的人所具有的优势/","text":"1.在主流观点之外能洞察出被人未曾发现的机会. 2.形成个人核心竞争力，避免低层次的同质化竞争，使自己不可代替. 3.拒绝他人和大众给自己贴上标签，以更开放和自由的心态发展自己. 4.因为不必迎合社会主流而节约了大量的时间精力，可以专注于做好自己的事. 5.为大众带来新鲜的见解和启发，形成对公众的影响力. 6.具有更高的可辨识性，更易于形成个人品牌. 7.吸引到其他独特而优秀的人，与他们成为朋友或者合作伙伴","tags":[{"name":"貌似有知识","slug":"貌似有知识","permalink":"http://yoursite.com/tags/貌似有知识/"}]},{"title":"普通人和高手的区别","date":"2017-04-09T14:01:55.000Z","path":"2017/04/09/普通人和高手的区别/","text":"普通人和高手有一个很大的区别，就是视角区别。普通人只会站在自己的角度看问题，谈感受；高手会切换视角，站在别人的角度看问题，感受他们的感受，从而解决问题。 站在用户的角度看问题，能把营销在做好，产品做好；站在领导的角度问题，能了解他的需求，博取他的欢心从而升职加薪；站在异性的角度看问题，能处理好男女关系。 只可惜，大部分普通人只会站在自己的角度看问题：抱怨用户太蠢、领导太傻、女人太拜金。","tags":[{"name":"貌似有知识","slug":"貌似有知识","permalink":"http://yoursite.com/tags/貌似有知识/"}]},{"title":"更高的标准才会有更好的选择","date":"2017-04-09T13:59:29.000Z","path":"2017/04/09/更高的标准才会有更好的选择/","text":"决策心理学认为，人在面临选择时，通常会采用“满意原则”，而不是“最优原则”。也就是说，如果找到一个满足内心标准的选项，就会采纳这个选项，余下的选项就放弃了，而不是对比所有的选项，然后选出其中最好的。因此一个人会不会做出一个尽量好的选择，更他所采纳的标准有很大的关系。 一个成熟的人，他的标准来自他的内心，而大多数人，却受环境所左右。一个年轻人，进入一所不那么优秀的学校，对自己的标准会不由自己的降低以适应这个环境，减少自身与环境的冲突，而这种做法对他们的人生也许是致命的。","tags":[{"name":"貌似有知识","slug":"貌似有知识","permalink":"http://yoursite.com/tags/貌似有知识/"}]},{"title":"说说我眼中的巴菲特","date":"2017-04-09T13:56:10.000Z","path":"2017/04/09/说说我眼中的巴菲特/","text":"对于商业有点兴趣的朋友都应该听说过巴菲特和索罗斯,毕竟商业的最高境界也就是”资本游戏”了,先不说索罗斯,先说说巴菲特. 巴菲特被认为是世界上最成功的投资者之一,2008年他的财富超越比尔盖茨成为世界首富,刚才看了一下,现在是世界二富,4500亿软.今天我们不谈财富,就评其人.但凡对投资有一点兴趣的大多数人一定和当年我的一样,对巴菲特所坚持的投资理念奉若神明,视他为偶像,对他的一言一行顶礼膜拜,今天我带你重新认识一下巴菲特,毕竟他曾是我的偶像. 真的有股神吗?巴菲特有一句名言:”我们喜好的持有期就是永远”,这也就是他那众所周知的投资策略-“买入并长期持有”.对,这句话是他告诉所有投资者的,但是他却不是这么做的,所谓兵不厌诈,他声东击西,指南打北,出尔反尔. 2003年,他购得5亿美元的中石油股票,消息一公布,无数的股神追随者相继跟入,攥住中石油的股票死也不放.”股神”果然不负众望,”苦苦守候”了四年,等他的信徒差不多都进场了,便在2007年7月悄悄地抛售了中石油的所有股票.单单这一笔,”股神”就从中国老百姓身上掠走35亿美元.有练就绝世武功的葵花宝典,你会告诉别人吗? 再说长期持有,纵观巴菲特的整个投资生涯,他真正长线并长期持有的股票总共才7支,你不知道吧?他同时还是这7家公司的大股东,是”内线者”,你知道吗? 恩,再来说说内幕交易……算了,这个我也是略懂皮毛,不扯了. 对了,忘了告诉你,巴菲特的父亲是美国参议院议员和国会金融委员会成员. 之所以想说说巴菲特,就是我在铁杆巴粉的三年里学会了一件事,学会了质疑,学会了立体的看一个人,学会听他没有说什么.我好想再喷一喷宋鸿兵,多少好娃被他带环了.","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"},{"name":"投资","slug":"投资","permalink":"http://yoursite.com/tags/投资/"}]},{"title":"对赌天气跨界营销","date":"2017-04-09T10:13:08.000Z","path":"2017/04/09/对赌天气跨界营销/","text":"Alan Perry是美国北卡州Wilmington一家小珠宝店的老板。 2010年冬天，他推出了一个很有趣的促销活动： 如果在感恩节之后的2个星期里，你在店里买了珠宝。圣诞节当天，假如北卡另外一个小镇Asheville（距离Wilmington500公里左右）圣诞节当天下雪超过3英寸，珠宝留着，钱全退，全退！这个消息一下就在附近传开了，甚至Asheville的当地居民也专门驱车500多公里来这家珠宝店买珠宝，一时间门庭若市，销售大涨！ 结果圣诞节当天，极少下雪的Asheville竟然下了6英寸的厚雪，小店前排满了申请全额退款的人，Alan Perry二话没说，珠宝保留，全额退款，当天退了40多万美金。 Perry失算了？要破产了？独自一个人流泪到天亮？ 错! Small pain, large gain: Perry bought a weather-based insurance policy from his longstanding insurer Global Weather Insurance. 因为这位Perry老板根据自己那段时间的销售额购买了天气保险。 这种保险方式原本是要让一些「靠天吃饭」的商家在使用的，譬如卖伞的小店主，每个月要下十五天以上的雨天才能获利，阿婆可买一份「15天以上会下雨」的保单，假如真的下雨不超过十五日，就会获赔一笔足以平摊她生意损失的费用。 这位老板充分利用这种气象保险，借助这种极富传播力的趣味活动，绕开了打折送赠品之类的老套促销手段，达到了提升销售、提升知名度的目的。 这位老板后来变本加厉，搞出了“结婚当天如果下雨婚戒免费”等活动 ，都有效地提升了销售，没有降低利润率。 对于金银首饰珠宝这种同质化竞争很强的产品，如果依赖老套的打折、赠品等方式，是很难在不降低利润率的前提下获得销售增长的，营销人的真正实力，在这种同质化竞争市场上体现得最为明显。这位Perry老板，通过对赌天气这种趣味跨界营销活动，通过保险对冲其风险，大大提升了自己店铺的知名度，最后连CNN的新闻都报道了他的促销活动（文章来源：Six inches of snow gets free jewelry for 311 lucky shoppers），免费给他做了一次广告，生意涨得一发不可收拾。 (文章来源:https://www.zhihu.com/question/20431221/answer/145301562)","tags":[{"name":"营销","slug":"营销","permalink":"http://yoursite.com/tags/营销/"}]},{"title":"《一流人才思考习惯》","date":"2017-03-29T16:37:04.000Z","path":"2017/03/30/《一流人才思考习惯》/","text":"我们常说习惯决定命运这句话不是没有道理的，本书的作者高妻荣是一名运动教练，她用她自己多年的经历告诉你一流的运动运是如何思考的，又是如何行动的，虽然这些优秀的习惯来自于运动员，但是这种共通的“思考习惯”，对于任何领域的一流人才来说都是通用的，就算你现在不具备这种取得成就的资质，只要你改变自己的思考方式，你照样能将这种宝贵的资质据为己有。 一：每天的习惯总有自己执着的事；脸上永远不会缺乏笑容；每天都不忘记早餐；精神百倍的与人打招呼；每天都做同样的事；特别注重平衡；心智坚定无法动摇。 二：采取行动时的习惯总会想象自己成功的时候的样子；从不会忘记检查自己的计划表；总会通过反推来分析事物；总是惜时如金。三：为了将实力发挥到最佳的习惯控制自己的心态；总是执着于自己所关注事情的某一点；靠着呼吸来调节自己的情绪；保持着最挺拔的身姿；能灵活划分“紧张”和“松弛”；就算在逆境中也不轻言放弃；不会在意旁人的说法；不会过分在意成就；利用对手来让自己强大；总是能开心开始，开心结束。 四：被任务追着跑时的习惯把压力当做朋友；善于苦衷做乐；从不多想；永不消沉；不会满足于简单的反省；好胜；对成功体验有特别的执著。 五：为磨练自我而形成的习惯不会忘记初衷；善于“偷师”；在人看不见的地方偷偷地努力；拥有有别于他人的享乐方式。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"《明朝一哥王阳明》","date":"2017-03-29T16:31:29.000Z","path":"2017/03/30/《明朝一哥王阳明》/","text":"第一次知道王阳明是在当年明月的《明朝那些事》里，这是读的第二本关于王阳明的书，没有读完，知识略读了一下，感觉写的不是很好，当然如果你没有细看，第一眼看上去这屎的不能再屎的排版也会让你放弃想读的欲望。下面是一些我摘抄的句子： 1.告诉你在这个险恶的世界上年轻人的希望在哪里，修炼强大的内心，你的人生永远你有出路！2.龙岗山上一轮月，仰见良知千古光。3.心即理，知行合一，致良知。4.一切战斗都是心战，内心的强大才是正真的强大！5.不要被自己的情绪所左右，偏激永远是因为你看的不够多。6.待一切都安静下来，不管你站在什么立场，且只问一句话：多久没有倾听自己的内心了？其实，世界是什么样子不重要，重要而是你需要什么！7.所谓天理，圣人之道，全在我心中，全在我与生俱来的秉性中，为圣之道，只需向自己的内心深处去挖掘和寻找。8心虽主乎一身，而实管天下之理，理虽散在万事，而实不外乎一人之心。9.此心安处是我家，给漂泊的心灵找一个归宿，给活着寻找一个意义。10.生命的价值在于她能够拒绝庸俗，能够灿烂奔放，但也可以在随波逐流中丧失任何意义，成为行尸走肉。11.立志，勤学，改过，择善！不立志就不可能勤学，不勤学也就无法成就。为人处世不可能无过，但应有过必改。你不可能让所有人都满意，但你应该让尽量多的人满意。同时，不仅自己向善，还要帮助他人向善。但责人向善必须注意方法，是人乐于接受，否则便会适得其反。12.幼稚的理想主义者为了理想去死，成熟的理想主义者为了理想而隐忍。13.俗话说得好，犯贱是普遍真理，你我只是其中之一。14.中国人的智慧是事缓则圆，一切都得慢慢来。15.有人的地方就有变数，有变数就有机会，从而可以推导出：人越多的地方机会越多。这就是无论哪行哪业，哪朝哪代，大家都爱往京城扎堆的原因。16.做起来，就能成，你要相信人可以凭借意志和内在的修炼成为你想成为的人！17.能有得力处，便是用力处。18.沉默里也包含着三种危险：疑而不问，蔽而 不辩，这是愚蠢的沉默；用不说话讨好别人，这是狡猾的沉默；怕被人看清底细，故作高深掩盖自己的无知无能，这是自欺欺人的沉默。19.不是你所处的环境决定了你的命运，而是你所做的决定注定了你的命运。当你制定一个目标时，整个宇宙都会让你知道接下来会发生什么。20.判断人生价值的标准不在外部世界，不在官职高低，不在权势大小，而在你的内心。心安自足，充实强大才是安生之本，成功之基。21.温和是顶级的暴力。22.坚强的意志和决心可以战胜一切困难，执着的信念和无谓的心灵才是最强大的武器。23.不用感谢我此刻的宽宏大量，所谓宽宏大量云云，皆因你目前的档次不够。24.低调是弱者的权利，强者从来不需要掩饰。25.招降是虚，进攻是实。要让对方绝望，必先给其希望，此所谓围师必阙。26.在这个世界上有人想脚踏两只船，左右逢源。有人想不问是非，抽身事外。但只有立场坚定的人，才可能有所作为。27.人可以不识字，但是不能不识相。28.困兽是不好斗的，但只要把它放出来，就好斗了。29.能改的叫缺点，不能改的叫弱点。30.懂得明哲保身不难，难的是懂得什么时候挺身而出。31.所谓敌人，不过是那些迫使自己变得强大的人。32.请求援军就好比买保险，用不上时痛苦，用上时更痛苦。33.心学是教会了很多人使用权术，但更重要的是，它教会了我们什么时候不用权术，这才是它之于这个历史悠久的泱泱大国的最更本的意义。34.乱世就是舞台，演技才是王道。35.历史的统治阶级无不是体制内给黄金，体制外给信心。36.政治选择了思想，而不是思想改造了政治。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"《数据统治世界》","date":"2017-03-29T16:27:15.000Z","path":"2017/03/30/《数据统治世界》/","text":"《数据统治世界》已经不是我第一次读与数据有关的书籍了，但是总感觉是不得其要领，比如说呢，你没有掌握学会用数据研判趋势的能力，但是我一直在路上，希望《信息分析与决策》和《数据、模型与决策》同时加上我炉火纯青的python造诣一定能够打通研判趋势任督二脉，哈哈哈哈，想想还有点小激动呢O(∩_∩)O~~。好了，废话不多，《数据数据统治世界》开喷： 《数据统治世界》这本书告诉你怎么怎么让数据自己说话，同时他会告诉你很多生活中看似不合理的安排，其实那都是有道理滴。本书中列举了大量的与统计式思维有关的例子，从中你可以感悟到数据已经统治了我们的世界，如果你读了这本书，同时你又是生活中的一个有心人，你会惊奇地发现在日常生活中，你也能运用数据来做决定了。 全书主要分为五章，第一章：“关注异常值而非平均值”，他会告诉你为什么迪士尼不去改变让游客牢骚满腹的长队。第二章：“相关比因果更重要”，主要举了疾病侦测和信用评分的例子。第三章：“分层与同类比较”。第四章：“假阳性与假阴性的博弈”。第五章：“小概率的力量”。 如果你想给自己的数据分析入门找一个落脚点，这本书是一个不错的选择，他会告诉你，我们究竟是怎么运用数据的，我们该怎么运用数据，数据与我们的生活息息相关！","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"《0.5秒决定你的人生》","date":"2017-03-29T16:23:15.000Z","path":"2017/03/30/《0-5秒决定你的人生》/","text":"我这个人很少读鸡汤文，看书名很像是吧，其实不是的，这是一本教你练习微表情的书，这本书其实就想告诉你：一个好的第一印象取决于我们的表情是否能让对方看的舒服，而非我们长的是否漂亮。心动了吧，其实稍加练习，你也可以做到。下面简要的介绍一下这本书的内容： 什么才是真正的笑容呢？书中是这样说的:眼睛要笑的弯弯的，颧骨部位要抬起来，只露出上排牙齿，左右表情对称。 发自内心的笑容能让我们产生脱胎换股的变化，拥有迷人的笑脸能让你拥有更多的机遇，一个良好的印象能够让你人生的成功率提高九成，一张让人舒心的笑脸能让你卖掉手头的商品…… 用迷人的笑脸和对方说谢谢，经常微笑能让你获得好运，微笑能在相遇的瞬间表达谢意，笑容能够播散幸福，笑容能够大大改观你的人际关系……那怎样才能获得美丽迷人的笑容呢？其实很简单，你需要的仅仅是每天对着镜子练习三分钟，看看你的眼睛有没有笑的弯弯的，你的颧骨有没有抬起来，你有没有只露出上排牙齿，你的左右表情是否对称，只要注意坚持，就能养成良好的脸部习惯。","tags":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://yoursite.com/tags/读书笔记/"}]},{"title":"学习和智商有关系吗?","date":"2017-03-29T04:51:19.000Z","path":"2017/03/29/学习和智商有关系吗/","text":"相信你们看到这个标题就知道我要说学习和智商是没有关系的,是的,注意哦,我说的是学习. 学习关键是你要知道怎么去学习,否则你只能做一个笨蛋. 作为一个非科班出身的野生程序员,从我开始到现在的自学经验告诉我,学习应该是这样的:首先,你要知道哪里有问题,然后把大问题分解成小问题,最后再一个一个地去解决,最终你肯定会搞明白所有的问题. 学习的关键就是你每天都要进步,哪怕你每天只懂了一点点.要记住:学习不是百米赛跑,学习是看不到尽头的马拉松.你每天都向前走一点,越往前走你会发现你前面的人越少,当你发现你在前面已经看不到人的时候,你就已经非常非常非常厉害了.有一点我是确信的,那就是我知道”未来会牛逼”的”笨蛋”,一定是具有成长型思维的”聪明人”! 什么是成长型思维?就是我们在做一件事的时候,不要看当下会发生什么,我们要学会走进一个长的时时间维度,跨进一个大的空间尺度,看看未来会发生什么.“三十年河东,三十年河西”,老祖宗留下来的话不是没有道理的. 说一个聪明人和一个笨蛋同时做一道题,前者用了一分钟做出来了,做出来之后他就不想这个问题了,过一段时间就忘了,他印象不一定很深刻.然而即便后者用了10分钟做出了,他为什么用来10分钟才做出来?可能的原因有两个,第一个是他真的笨,第二个就是想多. 如果这个笨蛋还是不明白,这个时他还会去一直思考这个问题,所以笨蛋第一次花了10分钟,但是第二次就只用花3分钟,第三次一分钟不到就做出来了,重点是这个问题还一直在他的脑子里,在他的心里.以后再遇到类似的问题不但可以信手拈来还能提炼升华 所以这个笨蛋最后未必见得就比聪明人学的差. 恩,其实我就是那个笨蛋O(∩_∩)O.","tags":[{"name":"貌似有知识","slug":"貌似有知识","permalink":"http://yoursite.com/tags/貌似有知识/"}]},{"title":"最伟大的演讲家要具备的能力","date":"2016-11-07T07:38:44.000Z","path":"2016/11/07/最伟大的演讲家要具备的能力/","text":"最伟大的演说家都具备这样的能力：从专业或日常的产品中创造出某种有意义的事物的能力。 星巴克的首席执行官霍华德·舒尔茨卖的不是咖啡，而是办公室和住所之外的“第三空间”。财务专家苏茜·欧曼售卖的不是信托和共同基金，而是财务自由的梦想。 与此类似，乔布斯卖的也不是电脑，而是释放人类潜能的工具。你要不断问自己这个问题：“我真正出售的究竟是什么？” 记住，你的新产品本身并不能改变顾客的观念。你要向别人展示这个产品如何能够让生活变得更加美好。做到这一点，你就赢得了顾客。如果你还能用有趣的方式做到这一点，你就能拥有忠实的粉丝，他们会义务为你工作，替你宣传，帮你推销。","tags":[{"name":"商业技巧","slug":"商业技巧","permalink":"http://yoursite.com/tags/商业技巧/"}]},{"title":"如何选择创业方向？","date":"2016-11-05T07:33:55.000Z","path":"2016/11/05/如何选择创业方向？/","text":"判断大趋势、进行SWOT分析、寻找切入口，这些当然需要做，但创业不是择业，这些只是外因。而内因，不是方法，是种本能。 真正的创业者，不管他在做的事情我听没听过，只要听他讲，就会觉得总有机会，他热情万丈，内心燃火，谈到“那个方向”，他会两眼发光，非干不可，还要拉你入伙。我认为一个人在一段时间里，只会在一件事上进入这种状态。 你想要的，一定让你奇痒难耐，去说服家人，拉人入伙。如果根本没这状态，外因分析得再透彻，也是别人的创业。问自己，动力是什么。有了那个强大如风、把自己吹得站不稳、必须往前跑的动力，答案就不是一道选择题了。 人生积累处寻方向：你的创业方向离不开你决定创业那一刻之前的人生积累，尤其是你的职业生涯的积累。 如果你的积累是工程师，选择从解决问题的角度去创业是比较合适的。这个问题也应该是你自己本身需要解决的。更重要的是，你要多跟那些已经在创业的、创业小有所成的、创业失败的人去聊天。聊他们的项目，他们的产品，他们从0到1是怎么过来的。如果你足够有悟性，相信你能够从中找到你的创业方向的。","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"},{"name":"商业技巧","slug":"商业技巧","permalink":"http://yoursite.com/tags/商业技巧/"}]},{"title":"真需求还是伪需求","date":"2016-11-01T05:06:02.000Z","path":"2016/11/01/真需求还是伪需求/","text":"还要明确一点，客户的需求是无限的，而你的资源是有限的，你要做的不是调查所有目标市场客户的需求，并从中作出遴选。恰恰相反，你要用你有限的资源尽快找到突破口和卖点，找到一个值得深耕的市场。 第一步要做的是，按照你们创业的想法，用最快的方法做出一个非常粗糙的原型。这个原型甚至只是一个没有功能的空壳（软件用户界面或者纸板搭出来的硬件原型），让你们的团队自己用用看，把自己放在非常苛刻的客户的角度，看看是否会接受（不是接受界面本身，而是所表达的功能）。同时，用快速迭代来改进设计，比如在线募资网站Kickstarter上一个基于安卓操作系统的很有名气的游戏平台OUYA，他们的游戏手柄，就是先用木头做快速原型，在内部试用。目的是什么？在初期用尽可能小的代价，发现产品的不足，错误和不足发现得越晚，改正的代价就越昂贵。 第二步要做的是，找出具有创新意识、愿意和你一起玩的几个非典型客户，做出一个只有简单核心功能的原型请他们试用。能找到这种客户并不容易，可以有各种方式，比如向他们许诺第一批产品出来以后免费赠送给他们。但首先这些客户一定是非典型的极端客户。比如OUYA就会请一些游戏高手来试玩，OUYA的创始人就陪着一个游戏玩家一起玩游戏。 这些客户是极其宝贵的，他们不仅会指出很多你没有考虑到的地方，帮你拓展思路，甚至会帮你打翻原有的设计。在这一过程中你要注意观察这些极端客户的行为，不仅听他们说，还要琢磨他们为什么这么做。在这基础上你可以发现很多新的需求，甚至产品的独到卖点，因为很多客户需求是客户自己都没有意识到的。第三步，根据上面的需求分析，再反馈回来，做新的改进，并进一步完善产品。也就是说重复第一步和第二步。直到非常确信这就是客户想要的东西，而且产品也可以做公众测试了（可以想见，你找的那些陪你走这一程的极端用户是多么宝贵）。这时候基本功能就稳定了，但是还有很多bug（缺陷），没有关系，因为你下一步要做的是寻找更多客户验证需求，而不是debug（解决缺陷）。 第四步时，可以寻找更广泛的友好测试用户群体，通过观察和倾听，了解更多的需求。这时候大部分需求都是比较细微的，比如“那个颜色的遥控器我不喜欢”等，若有重大的需求改变，就需要做出取舍，因为这时候做改进已经非常昂贵了。向他们提问的时候多问开放型的问题，比如以why（为什么）、what（什么）、where（哪儿）、which（哪个）和how（如何）等开头的问题，而不要仅仅问“你喜欢吗”这样弱智的问题。 第五步，才是真正把产品做稳定，以及安排市场推广等常规的流程。 整个流程的思路就是先针对一群极端用户，通过看得见、摸得着的原型，渐进式地深挖用户需求，找到产品卖点和新的市场需求，在这过程中尽量把重大改进往早放；而不是针对大众市场，做一个大家都能想到的产品。 这对中国的创业公司更有挑战，因为中国人不喜欢表达自己的思想，所以更需要通过观察和提出开放型的问题来理解客户需求。 上面的做法对绝大多数创业者都是适用的，即使你原来就做这一行，也千万别自以为是，认为自己已经充分理解用户需求了。 要尽早接触客户，在产品还没有做出来的时候就要厚着脸皮见客户，和他讲你们的愿景和产品规划，谦虚地从他们那里学习，他们会告诉你很多有意思的信息。","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"},{"name":"商业技巧","slug":"商业技巧","permalink":"http://yoursite.com/tags/商业技巧/"}]},{"title":"一个好的计划书","date":"2016-10-31T04:37:12.000Z","path":"2016/10/31/一个好的计划书/","text":"1. 市场机会首先，潜在市场机会要大，而“不要太大”。 “不要太大”的意思是说这个市场最好是有经验和洞察的创始人在大多数人还没看到之前，就发现了。巨大但是众所周知的市场可能会带来过度的投资、恶性的竞争和产业整体不良发展。这也是个市场时机的问题。 其次，公司的增长最好来自市场本身的增长，而非抢夺竞争对手的份额。 再次，公司有机会成为市场中具有支配地位的第一或第二。第三和第四一般不具备市场控制力、定价能力，因而利润等方面会大幅下降。 有人说，特别是在中国做，我的公司只要在一个巨大的市场里获得2%或3%的份额就有非常不错的收入和利润了。这话可能不错，公司也是好公司。但是不一定适合风险投资。没有支配地位的公司一般难于保持风险投资所要求的高利润率、资金效率和高回报率。 2.竞争优势 第一，一个最简单的思考竞争优势的框架： 1. 用户愿意为你的产品或服务付的价格。 2. 成本。 一个公司要么能够让用户为类似的服务付更多的钱，要么能以更低的成本满足需求。能做到一点就很好，能做到两点的公司少之又少。竞争优势可以写一本书，因此这里不展开讲了。创业的朋友可以仔细从这两个角度深入思考一下你熟悉的成功企业，你们的竞争优势都可以归为这两点或两点的结合。如果想多了解，可以看看迈克尔·波特那些经典的有关竞争优势的文章。 第二，竞争优势能否持续。这样公司可以在一段相当的时间内，获得超额的利润和回报。 3.商业模型第一，有几个收入来源、各个来源的发生时间点、收入规模和增长率、影响收入的关键要素。 第二，主要成本，哪些可变、哪些固定、成本发生的时间点和决定成本的要素。 第三，需要多少资金投入才能获得正的现金流，何时能发生，working capital（营运资本）的需求如何，何时能开始盈利。 第四，找到商业模型中最关键的那几个点，它们如何影响收入和盈利。哪些点最难于执行等。 4.团队团队在要做的方向上是有相关和相当的积累的。 5.融资相关首先包括公司有一个仔细思考过的业务和产品发展计划步骤。达到每个目标需要什么样的资源和多长时间。这样团队可以以最少的稀释获得发展所需的资源。同时，也表明了团队对执行细节的把握和理解；其次要有合理的估值；最后还包括对投资人退出机制的考虑等。","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"},{"name":"商业技巧","slug":"商业技巧","permalink":"http://yoursite.com/tags/商业技巧/"}]},{"title":"由《战略》到人生的战略","date":"2016-10-27T04:28:08.000Z","path":"2016/10/27/由《战略》到人生的战略/","text":"从当下的均衡，你努力推动它向下一个均衡转化，你摆脱了当下的怪圈，财富，力量，所有你追逐的东西才能对你有用，如果你不能打破你当下生活的怪圈，换句话说，就是从这个均衡向下一个均衡转化的话，给你再多你想要的东西也没有用，这就叫人生的战略。","tags":[{"name":"心智","slug":"心智","permalink":"http://yoursite.com/tags/心智/"}]},{"title":"生物学的思维方式","date":"2016-10-25T04:22:36.000Z","path":"2016/10/25/生物学的思维方式/","text":"把时间这个维度带入到思考当中。根据环境、变量、一点点的变化，在每一个点上都追逐最佳策略。 一旦切换到生物学的视角来看问题，一时间的强弱胜负就变得不那么重要了。诸多环境变量相互叠加、作用和驯化、最终的游戏结局也许将出人意料。因此，一个生物，应该在每一个时间节点上都关注环境的变化，并找到最佳的生存策略，而不是什么终极解决方案。这就是生物学的思维方式。 我们今天谈商业，用的就是生物学的思维方式。 所谓生物学的思维方式，虽然是一个复杂的话题，但也不用讲的那么玄乎。简单说，就是把时间这个维度带到思考当中。不是按照既定的蓝图、目标、计划、策略去施工，而是根据环境、变量、一点点的变化，在每一个点上都追逐最佳策略！","tags":[{"name":"心智","slug":"心智","permalink":"http://yoursite.com/tags/心智/"}]},{"title":"价值？估值？","date":"2016-10-22T04:20:21.000Z","path":"2016/10/22/价值？估值？/","text":"不要让自己的估值过分的超过自己的价值。如果交易只有一次，那么，估值越高越好。可是注定要交易多次，那么情况就不同了。路很长，交易很多，甚至，大多数交易算不上里程碑，只不过是慢慢长路上的鸡毛蒜皮，于是，每次都想与大于价值的估值交易实际上是完全不可能的。 更为重要的，是另一方面。因为当你在意估值的时候，你就会忘记自己的价值，你就会不由自主去做那些提高你估值的事情，而不是去想办法提高你的价值。 长期来看，估值是虚幻的，虽有波动，却实际上锚定在价值上，价值不增长，长期来看估值一定上不去，而且既然有极度高估，那么就不但随时有低估，还随时有极度低估！—忘记价值，追求估值，这肯定是极度愚蠢的。","tags":[{"name":"心智","slug":"心智","permalink":"http://yoursite.com/tags/心智/"}]},{"title":"创新是落后者的权利","date":"2016-10-20T04:12:25.000Z","path":"2016/10/20/创新是落后者的权利/","text":"关于创新有一个广泛存在的错误看法，那就是让领先者去领导时代潮流，而落后者则应该把注意力放在向别人学习上。如果你的企业甘于落后那么这中思想就是正确的，反之，那么这种思想就是完全错误的。 这里所说的创新是那种改变游戏规则，改变商业模式，“根本性”的创新。这种创新往往具有历史意义，你一旦成功，会有很多后来者向你学习。你不是创新图存，而是引领风气之先。这样的创新最大的特点，不是“开放的头脑”之类的优秀品质，而是风险！ 如果你是一个有心的领导者，你每时每刻都可以接触到各种号称可以改变世界，至少可以改变你们公司的“新思想”。这些思想逻辑上都是无懈可击，但实施过程是有风险的。对于领先的企业，没有必要冒这种风险。只有落后者，光脚不怕穿鞋的，反而可以冒这个险。冒险只要还有赢得机会，不冒险就输定了。","tags":[{"name":"心智","slug":"心智","permalink":"http://yoursite.com/tags/心智/"},{"name":"商业技巧","slug":"商业技巧","permalink":"http://yoursite.com/tags/商业技巧/"}]},{"title":"你有经历过王阳明时刻吗？","date":"2016-10-17T04:08:13.000Z","path":"2016/10/17/你有经历过王阳明时刻吗？/","text":"所有对世道人心有起码智慧的人，他的人生当中都会有这么一个叫“王阳明时刻”，就是他突然意识到，我要想过的更好，我要达到更高的人格和事业目标，那不是向外求的，你要学会向内求，你自己才是一切问题的根源。 吴伯凡老师说过一句话：说远方过来一个人，那是个人吗？不是！那是一个认知模式！一个人的本质就在于他的认知模式，他跟世界的关系，是跟他理解这个世界的方式有关的，和他占有的资源是没有什么关系的。","tags":[{"name":"心智","slug":"心智","permalink":"http://yoursite.com/tags/心智/"}]},{"title":"从哪里发现用户的需求？","date":"2016-10-14T10:47:55.000Z","path":"2016/10/14/从哪里发现用户的需求？/","text":"商业价值来自需求的满足。源源不断地发现需求并满足这些需求，就会源源不断地产生商业价值。但是发现需求的过程中往往伴随着很多陷阱。真需求，假需求，强需求，弱需求……一旦掉入陷阱，就会浪费大量的时间成本。 1.找极端用户，渐进式深挖需求首先明确的一点是：调查问卷是不会帮你发现需求的。因为所有的调查问卷都是基于当前的技术和当前的市场做的，这对于洗发水之类的成熟行业很合适，而对于大部分有创新业务特别是破坏性创新（disruptive innovation）的创业公司来讲则并不适用，因为客户并不熟悉你的技术和想法，他们甚至无法理解你的意图。 2.改变生活的产品，来源于真实的生活如何找到靠谱的用户需求，不让设计、开发资源浪费，就是回归“真实”的生活。 要找到需求，就观察人们现在的行为。欲望像洪水，会疯狂冲破阻拦它的一切。它会寻找堤坝最薄弱的地方，喷涌而出。所以，人们已经表现出的行为才是最能体现内心需求的。人类已经存在了几十万年，需求基本是不变的，只是行为会越来越高效。对于每一个时代而言，某种需求都会选择最便利的解决方案。人们会日复一日地使用它，以至于它太平常了，就在日常生活中，吸引不了那些梦想着用完美的创新颠覆世界的创业者。有种需求叫“我想告诉你件事儿”，它经历了吼、喇叭、飞鸽传书、驿站、邮局、电报、电话、QQ打字、视频聊天等一系列解决方案，现在流行的是微信，那再过10年是什么呢？这个需求太平常了，平常到就是地铁上旁边那个拿着手机在打电话的人。如果你希望你的产品成为下一个时代每个人都会用的东西，就要观察在这个时代每一个人在最平常的生活里会用什么。 3.竞争对手是最好的老师讲到竞争对手，实际上他们是你最好的老师。他们已经做过一轮甚至几轮市场调查，用他们的产品前仆后继地蹚出了一条血路。你一定要把市面上主要竞争对手的产品都拿来分析一下，把你自己放在用户的角度，看你能不能说服你自己，你的产品是有竞争力、有卖点的。如果连你自己都说服不了自己，那还是慎重考虑创业——别说你没有竞争对手，客户没有替代方案！你一定是在自欺欺人！如果创业还处在这个状态，真的是“盲人骑瞎马，夜半临深池”。","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"},{"name":"商业技巧","slug":"商业技巧","permalink":"http://yoursite.com/tags/商业技巧/"}]},{"title":"如何判断市场是否值得进入？","date":"2016-10-11T10:43:04.000Z","path":"2016/10/11/如何判断市场是否值得进入？/","text":"进入市场前已经有很多竞争者了，如何判断是否还值得进入？ 在创业初期一定要慎重选择一个有成长空间的项目。行业前景很好的时候，创业者更容易把事做成，建立起信心。但大家往往都不是第一个进入市场的，大多数情况下市场已经存在不少的竞争者了。这时候该如何评估自己的实力以及该市场是否还值得进入呢？ 1.创业的第一步是创新我们做的事情是不是足够创新？是不是一片蓝海？如果已经有很多竞争者，要非常慎重地考虑你的差异化。新创造的价值是否足够显性，足够有说服力让竞争者的用户或者客户来选择你的产品。不要只是好一点儿，而是颠覆式的创新。 竞争者有没有做大？如果都没有做大，要好好地慎重思考是什么原因。有时候可能不一定是团队的原因，极有可能是市场的原因，一方面是市场的需求没有那么大，可能只是小众的需求；另一方面是时机还没有真正到来，如果贸然进入，也不会得到市场的认可。比如中国的Pinterest（品趣志）模式图片社交分享网站，虽然进入这个领域的资本很多，团队也很优秀，但是大家都没有做大。原因到底是什么？要慎重思考。 如果到了一个有竞争者做大，尤其是形成寡头的局面下，你若想进入，就要看你的模式有没有形成独特的竞争优势和竞争柔道。假设对手也会改变，执行力还很强，钱又很多，你进入时就要想得很清楚。 2.靠细分市场立足当市场成熟之后就会出现个性化需求，尤其是在这个个性化的年代。 比如说在视频网站这种基本靠烧钱活下来的市场里面，不仅活下了优酷、土豆，而且还有搜狐视频、爱奇艺、乐视。市场确实只容得下一个优酷，容不下另一个土豆，但是市场还容得下一个主打美剧的，还容得下一个主打高清的，还会有通过买版权活下来的，所以这就是一个永久的矛盾，一只大象总想大而全地“一揽子”解决问题，但总有蚂蚁来解决大象看不见的地方。而且谁能保证蚂蚁不会变成下一个大象？会跳舞的大象毕竟不多见。","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"}]},{"title":"如何修筑壁垒？","date":"2016-10-10T10:30:32.000Z","path":"2016/10/10/如何修筑壁垒？/","text":"对于早期创业团队，产品推出后很容易被复制，如何建立自己的竞争壁垒？ 在一个巨大的市场中，往往可以有很多公司互相竞争。早期创业者在资金劣势、人才劣势、技术劣势的情况下，定位出自己的竞争差异尤为关键。想为用户提供产品和服务，首先就要知道市场在哪、用户在哪、自己的竞争力在哪。 一旦确认早期的用户需求，有了不错的增长之后，创业者就一定要考虑如何建立壁垒和竞争优势。 可以建立壁垒的地方有： 团队人力优势 产品功能优势 核心技术优势 内容优势 资源优势 渠道优势 口碑品牌优势 商务运营优势 用户优势：用户数、关系网络，或数据 生态系统优势 要分析所有潜在对手的优势和位置，对比自己的团队、用户群、资源和产品，来确立自己适合在哪里集中资源，建立壁垒。当然人人都想要9和10。但早期团队往往只能从1、2、3、4起步，向5、6、7、8发展，最后到达9和10。 一般早期团队最少要做到产品在功能和技术上比竞争对手快4~6个月，团队能力上比对手强。 建立壁垒往往可以和用户需求与技术结合，从没有壁垒的地方创造出壁垒。如何修筑壁垒——论一个“砖瓦匠”的自我修养。这里的“自我修养”，包括你了解自身的缺陷，知道如何发挥自我优势，熟知敌我关系，知己知彼。技术是基础，那这种“自我修养”就该是上层建筑。基础决定壁垒能否建立起来，上层建筑决定你能否发展壮大。","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"}]},{"title":"你错失了哪些创业机会？","date":"2016-10-07T10:25:46.000Z","path":"2016/10/07/你错失了哪些创业机会？/","text":"创业的过程仿佛就是不断看到机会、错失机会的过程，看到Facebook的时候想，哎呀自己怎么没想到呢。但其实机会有的是，有了Fackbook以后还能有 Twitter，有了 Twitter 以后照样还能诞生照片分享软件Instagram。每次觉得痛失某个创业机会的时候，下一个机会可能正在面前走过。所以不用太过担心，摆正心态，不断累积不断尝试，为下一个机会做好准备。当机会来临的时候，所有的付出都会得到回报，就像我们2010年遇到网页游戏的机会时那样。 回顾历史，学学古人的智慧 先抛开这个问题，让我们回头看看 。每个时代都有每个时代独特的机会，都出现在自己独特的领域。像赵佗那样建个南越国是根本没有可能的，但是其他领域的机会却多如牛毛。三皇五帝，唐尧虞舜，靠教化百姓、种地打鱼、兴修水利，就能成就天下圣王；商汤周武，靠武力争夺天下；到了春秋战国，普通士人的机会，则在于在思想文化上开创新的学术流派。 所以不要那么多地去听周围的声音，什么职业是好的，你该成为什么样的人，而要更多地去思考我擅长做什么，我爱做什么。一个成功的公司，它的CEO做的一定是他擅长的事，并且是他爱做的事。","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"}]},{"title":"一个有效的新产品上线策略应考虑哪些因素？","date":"2016-10-05T10:09:58.000Z","path":"2016/10/05/一个有效的新产品上线策略应考虑哪些因素？/","text":"和线下的传统商务不一样的是，互联网这条商业街上并没有现成的精准用户。产品的推出只是最基础的工作，通过哪些策略去获取正确的用户，是产品上线后面临的第一个问题。 1.精准精准再精准。首先要分析谁是你的目标用户、核心用户。 2.低调低调再低调。如果你的第一批目标用户是非IT群体，建议可以尽量在IT圈保持低调，不然有这么几点坏处：第一是吸引了非目标群体的用户，这些用户基本是本着调研产品的心态来的，会影响产品的数据，得不到正确的反馈；第二是会在行业内引起很多人的注意，过早让自己的产品暴露在全中国产品经理的雷达下，提前引入很多竞争对手。 3.简单简单再简单。 产品一定要简单，把核心功能打磨得非常锋利，其他非核心功能可以不做，让产品在发布的时候非常有冲击力。首先用核心功能来试验市场，如果核心功能能够打动市场，再安排人力、时间来开发二级功能。如果核心功能不能打动市场，二级功能做得再好，也不能打动市场。而且领先于对手第一个推出产品，最好的用户都被吸引过来，会有先发优势。 “精准”、“低调”和“简单”。“精准”告诉你要找准目标用户，找到发力点；“低调”可以帮助你减少不正确的反馈和不必要的竞争；“简单”让你的产品变得非常尖锐，开辟市场，发挥优势。","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"},{"name":"商业技巧","slug":"商业技巧","permalink":"http://yoursite.com/tags/商业技巧/"}]},{"title":"新产品上线策略","date":"2016-10-03T08:35:35.000Z","path":"2016/10/03/新产品上线策略/","text":"一个新产品上线策略主要可以从以下几个方面来考虑： 1. 商业。一个公司的所有商业行为都是为了商业目标服务的，发布、运营一个新产品也是如此。目标用户和市场情况如何，产品如何到达目标用户和市场；产品和商业模式如何运转并形成竞争力，产品如何与市场上的各利益相关方形成有效的合作关系，产品和配套的服务如何为公司创造可持续的经济利益。只有商业问题想清楚了，后续的具体做法才有坚实的目标和依据。 2.产品。弄清此次新产品上线的目的是什么，是要大张旗鼓的营销，还是悄悄进行的测试。 检验产品前端（直接面对用户的界面）能为目标用户提供怎样的使用体验，以及产品后端（服务器、CDN等）能支撑多少用户并发、稳定、流畅的访问，为产品正式上线做准备。 在产品中如何布局数据采集点，建立分析模型，为产品上线后的快速迭代、持续改进做准备。 建立用户反馈收集和处理机制，如何及时应对用户反馈、利用用户反馈进行产品改进做准备。 3.营销。选择专业公司合作还是自主进行，使用什么辅助工具。 针对目标人群进行营销方案的策划，包含策略制定、创意制定、渠道选择、效果评估等。 营销导来的用户，到达产品的过程中体验如何，产品如何最高效的吸收这些用户。 如何让用户自发的产生二次营销，产品和运营在其中如何支持。 最后，一定要注意上线前的测试。缺乏测试，直接让新产品公开上线、推广，可能在这重要的初次亮相中不仅无法收集到有效的用户和产品数据，无法获得积极的营销效果；甚至造成恶劣的影响，让产品以后都无法获得用户和市场的认同。上线前测试的目标，就是在可控的环境中模拟产品正式上线可能遇到的各种问题，以便及时改进产品、并让各团队做好产品上线的准备。","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"},{"name":"商业技巧","slug":"商业技巧","permalink":"http://yoursite.com/tags/商业技巧/"}]},{"title":"用最土的办法获得用户","date":"2016-10-01T08:28:16.000Z","path":"2016/10/01/用最土的办法获得用户/","text":"一个产品，三分设计、七分运营，冷启动是考验运营的基本功。 第一步：搞清楚你的目标用户，千万别铺大平台，现在不缺平台，缺的是扎实解决小量用户垂直需求的精品。听人说过一句话：只做1厘米宽，100米深的事情。搞清楚你所服务的那一小撮人是谁。 如果一旦不幸，你做了个平台，恭喜你，你得想清楚你的运营策略，先抓住某类用户，比如你的平台是C2C，那么你先服务好商家还是用户？这时候听听有经验的人怎么说吧，答案很简单——商家。 第二步：用最土的办法、低成本获得用户，搞清楚目标用户后，80%的情境就是你知道去哪里找用户了。比如你就为中学生服务，那就去中学生扎堆的地方吧，发传单，设咨询台，找校方做赞助，做宣讲，总之别在家里待着。让那些鼓励你去买百度关键词、去分众买广告、去CCTV砸钱的人一边儿待着吧。 第三步：让第一批用户用得爽。我们只讨论运营层面，所以假定你的产品设计和体验是OK的，这时候爽不爽全在用户的心理感受，不同产品爽点不同，社交产品得热闹，工具产品得高效，内容产品得有料，如果没有咋办？好吧，你自己每天穿50个马甲不断激励你社交产品的种子用户，工具类产品就来人工智能，至于内容产品，你每天熬到深夜精选内容传上来再用 Photoshop（图片处理软件）美化一下，发布吧。 第四步：持续第一至三步。运营就好比夏天吹空调，你面对的永远是个老旧空调，热得要死的时候，打开空调没啥感觉，耐心等待，慢慢地温度就降下来了，爽点要在很久以后。而那些一开空调就冷气十足的永远是别人家产品，所以，坚持、等待，你会让你的产品不再冷的。创业团队早期是怎样快速尝试和快速改进的？ 产品上线后，看起来再完美的方案，也会因为一些细节没有被考虑充分而需要调整产品。快速尝试和开发的能力对效率而言非常重要。掌握正确的方法，在现有的方案上稍加调整，就可以解决大部分问题，而且成本更低。","tags":[{"name":"商业","slug":"商业","permalink":"http://yoursite.com/tags/商业/"},{"name":"商业技巧","slug":"商业技巧","permalink":"http://yoursite.com/tags/商业技巧/"}]},{"title":"《经济学通识》","date":"2016-09-26T08:18:02.000Z","path":"2016/09/26/《经济学通识》/","text":"这本书断断续续读到现在还没有读完，先占个坑。 《经济学通识》，薛兆丰老师在序里这样说：用什么养的眼光，就有什么样的世界。随着阅读和思考的深化，你将逐渐学会把“愿望”和“结果”分开来衡量；你知道不仅要看“局部”还要看“全部”；你不仅能看见“别人看的见的”，还能看见“别人看不见的”；你会发现“事实是什么”比“别人怎么形容”更重要；你还会觉得不少过去看来理所当然的因果关系其实颠倒过来才对。 改造“世界”，非经济学所长；但改造“世界观”，却是经济学的强项。阅读本书的后果，就是“世界观”的转变。","tags":[{"name":"经济学","slug":"经济学","permalink":"http://yoursite.com/tags/经济学/"}]},{"title":"创业的修炼","date":"2016-09-25T08:15:26.000Z","path":"2016/09/25/创业的修炼/","text":"创业不是突然迸发的，她是有过程的： 第一：你的心态是不是一直在磨练自己，让自己成为一个有心的人 第二：你是不是到了第一线，你是不是踏实的为这个结果和目标负责任 第三：等待机会","tags":[{"name":"新边疆","slug":"新边疆","permalink":"http://yoursite.com/tags/新边疆/"}]},{"title":"如何让潜意识帮助你思考？","date":"2016-09-22T05:06:43.000Z","path":"2016/09/22/如何让潜意识帮助你思考？/","text":"潜意识会帮助我们思考，即使我们不主动去想一个问题时，他也会非常“勤奋”的为我们工作。更有意思的是，潜意识不会被我们的条条框框限制住，他就像不羁的游侠，游走在我们思考疆域的角角落落。 那么，怎样才能让潜意识为我们工作呢？在讨论创意思维的经典之作《创意的生成》一书中，介绍了其中的奥秘： 1.尽可能地搜集原始资料 2.重复“咀嚼”原始资料，构思初始创意 3.终止有意识的思考，启动潜意识思考 4.随时准备迎接“灵光乍现”的时刻降临 5.加以改造、完善，使之切实可用 总之，你要记住，如果你想让潜意识为你工作，就首先必须向潜意识“投喂”足够多的“养料”，有了这些“养料”之后，潜意识用它们不断进行重新组合的试验，直至最好的想法出现。","tags":[{"name":"心智","slug":"心智","permalink":"http://yoursite.com/tags/心智/"}]},{"title":"《产业阴谋链：笔记六 结语》","date":"2016-09-20T04:47:51.000Z","path":"2016/09/20/《产业阴谋链：笔记六-结语》/","text":"由于我们已经进入了前所未有的产业链战争的新时代，因此政府推动的产业政策就格外的重要。 过去中国的企业犯了很多错误，例如市场换技术，结果市场丢了，技术也没换来。这两年很多地方政府呼吁企业搞产业升级和品牌战略，这又是一个误区。所谓的产业升级，不应该仍然在6+1的1上面搞升级，而应该从1升级到6的环节。因此我们不能倒果为因。政策的转变必然牵扯到思维转变的先行，只有政府，企业，都发挥思维的创新，进一步理解中国产业链没有来得及打造的闭环，理解中国企业受阻的瓶颈（这个瓶子是倒着放的）即如何从1过渡到6，进而打造属于中国特色企业的产业链，才能真正地走出低谷。","tags":[{"name":"经济学","slug":"经济学","permalink":"http://yoursite.com/tags/经济学/"}]},{"title":"《产业阴谋链：笔记五 法制化游戏规则的缺乏助长金融战》","date":"2016-09-17T04:46:06.000Z","path":"2016/09/17/《产业阴谋链：笔记五-法制化游戏规则的缺乏助长金融战》/","text":"书中举了这么一个例子：农民灌溉的流程是，在打开水闸之前要先挖沟渠，然后打开水闸灌溉农田。要是你忘了挖沟渠怎么办呢？结果就是水闸一开，洪水马上淹没了良田。我们今天的国际化包括头上的两只秃鹰，就是打开水闸之后，忘了挖沟渠了，洪水漫流大地，把我们内资企业的良田美地都淹没了。 那么什么是沟渠？那就是你一定要指定一个严刑峻法的法治化游戏规则，这个规则是要控制这个国家的所有个体包括政府包括国有企业包括百姓。如果缺乏一个严刑峻法的法治化游戏规则，而盲目的引进外资，这两只秃鹰将会像洪水一样席卷大地，把良田都淹没，如此未来的格局一定是大欺小，强欺弱。 产业资本和金融资本在这种无沟渠的环境下，他们对我们企业的掠夺简直让我们国内工厂欲哭无泪。举例而言，德国施奈德想要收购正泰，而正泰不想卖，结果施奈德到处控告正泰抄袭仿冒，到处打官司，把正泰搞烦了，他说不定就卖了。为什么这些产业资本这么嚣张呢？因为这就是一个没有挖过沟渠的中国，他们可以用这种不正当的手段大欺小强欺弱。 产业链阴谋下中国企业的战略出路：产业链高效整合。面对重重危机，中国企业的出路在哪里呢？郎教授举了这么一个例子：世界知名的服装品牌西班牙的飒拉（Zara），系统地解答这一问题。飒拉的成功简单的讲就在于整条产业链6+1的高效整合。我国服装制造业其实也有6+1的部门，但大多数分属于不同的企业，更重要的是缺乏“高效”的整合。什么叫做高效整合，简单的讲，我国服装业者走完整条6+1的流程需要180天，而飒拉走完整个流程只需要12天，也就是他们整条产业链的整合速度是我国服装业者的15倍。 飒拉怎么做产业链的高效整合呢？飒拉为了加快运输的速度，他们在物流基地挖了200公里的地下隧道，用高压空气运输，速度奇快无比。此外，为了加快运输速度，他们用飞机而不是轮船从西班牙将成品运送到上海或香港，虽然飞机运费很高，但是高效整合更重要，成本会更低。 飒拉透过产业链的高效整合大幅压缩成本，而同时透过高效整合作市场的快速反应者，因此他们的衣服总是最新潮，最受市场喜爱。飒拉的产业链高效整合思维应该对我们的企业非常有启发，因为这才是我们企业的未来战略出路。","tags":[{"name":"经济学","slug":"经济学","permalink":"http://yoursite.com/tags/经济学/"}]},{"title":"《产业阴谋链：笔记四 产业链阴谋与两只秃鹰的金融超限战》","date":"2016-09-15T04:44:25.000Z","path":"2016/09/15/《产业阴谋链：笔记四-产业链阴谋与两只秃鹰的金融超限战》/","text":"简单解释一下标题：“产业阴谋链与两只秃鹰的金融超限站”，即产业资本和金融资本这两只秃鹰利用中国企业产业链定位悲剧，今天的中国是一个以1（1即加工制造）为主而不是以6（6：产品设计，原料采购，物流运输，订单处理，批发经营，终端零售）为主的产业链结构，从中攫取利益。 安海斯-布希公司就是头上翱翔的第一只秃鹰，他叫做产业资本。产业资本对中国企业的掠夺，其可怕程度大家必须要清醒知道。 那么二只秃鹰是谁？举一个例子，徐工是重工业领域，美国的凯雷基金想收购徐工，假设徐工以100块的价格被卖掉，凯雷基金将可能会以十倍的价格，将它分拆转卖掉，到时候他就会赚大头。或者凯雷将徐工整合进入整条产业链而获取整合的巨大收益。凯雷基金是谁，凯雷基金就是天上翱翔的第二只秃鹰，它叫做金融资本。 很多人可能就会有个疑问：我们企业家这么努力的工作都不能赚钱，老外凭什么能赚钱,郎教授在书中告诉我们,我们不赚钱，老外也不一定能赚钱，但是这一块钱制造业赔不赔钱不重要，假设最多赔一美金，但是整条产业链却能创造出十美金价值，因此制造业赔多少钱都无所谓，因为可以从6+1的6把1的亏损全部赚回来.因此对于两只秃鹰而言，它们并不是看制造业能不能创造利润，而是看能不能把制造业融入到产业链当中，这就是头上的两只秃鹰的产业链战略。秃鹰仍然会把制造业继续放在中国，为什么呢？因为他们要继续浪费我们的资源，破坏我们的环境，剥削我们的劳动，这就是所谓的“国际分工”。目前外资对我国企业的收购就像井喷一样，书中有这样一组数据,我国利用外资占GDP的比重已超过40%，外资企业占全国进出口总值的55.48%，外资企业占高科技产品出口的87%。","tags":[{"name":"经济学","slug":"经济学","permalink":"http://yoursite.com/tags/经济学/"}]},{"title":"《产业阴谋链：笔记三 二元经济引发通货膨胀》","date":"2016-09-12T04:41:38.000Z","path":"2016/09/12/《产业阴谋链：笔记三-二元经济引发通货膨胀》/","text":"猪肉价格怎么上涨了?原因很简单，郎教授在书中告诉我们是由二元经济现象造成的。养猪肉的民营企业家跟其它行业企业家是一样的，他们所面临的投资营商环境也是急速恶化。原因就是进口饲料价格大涨，还有猪瘟。按照二元经济理论他们就不养猪了，而把应该投资买小猪的钱不买了，去炒楼炒股了。 我记得上高中的时候政治老师说过供求关系决定产品的价格, 在书中郎教授告诉我们现在有些商品的价格显然不是由供求关系所决定的，比如说石油，比如说粮食,原因就是我们进入了一个前所未有的金融战时代,产品定价权不再由供需决定，而是由国际金融炒家所决定，我们已经进入了一个前所未有的金融超限战争的年代。 为什么金融炒家进入大宗物资的期货市场呢？炒期货的成败，有一个必备的原则，那就是经济基本面一定要配合你的炒作方向，比如我今天赌这个股票会涨，你就要肯定未来一定有人会买这个股票，比如说你认为大米会涨，你就一定要确认一定有一个国家去大买大米。你一定要掌控基本面才能炒期货，否则容易失败。 国际金融炒家是怎么想问题的?他们一下子就看到了中国，中国在资本市场上的影响力是不容小觑的,我们石油价格才涨了13%左右，全世界期货市场的石油价格当天一下子大涨，因为中国人买什么东西，什么东西价格上涨，中国人太多了。就以国际金融炒家的立场来看问题，中国人买什么东西，什么东西就大涨，这不就是基本面吗？因此在中国人买什么东西之前先买，比如从一百块炒到三百块，再卖给中国人，国际炒家就赚两百块。生产者没赚到好处，我们大亏，这就是国际金融炒家的阴谋。金融超限战的原则就是取得定价权,国际金融炒家为了取得产品定价权就开始选品种，首先他挑到了大米。为什么是大米？而不选小麦，这就是水平。因为喜欢吃大米的国家相对吃小麦国家而言，一般而言都是比较贫穷的。这些贫穷国家的老百姓吃大米，如果买不到大米怎么办？就饿死了，但是不是简单的饿死就算了，这会造成政局的动荡！所以，把大米价格一炒高以后，这些吃大米国家的政府立刻面临倒台的危机，稻米的定价权由过去的供需双方决定，改成了国际金融炒家的定价，也就是国际金融炒家取得了最终定价权。由于是国际炒家取得了最终定价权，所以供需不重要，世界大米供过于求，石油供过于求，价格却不跌反涨，大宗物资价格是由国际金融炒家决定的，他们说几块钱就是几块钱。 书有这么一个小故事,韩国总统李明博要进口美国牛肉，韩国民众为什么这么激动要冲击韩国政府呢？！不是因为韩国人好斗, 是因为他们从亚洲金融危机学来的经验就是韩国一旦成功了进口美国牛肉以后，美国牛肉特别的便宜，他将席卷全韩国牛肉户，把全韩国养牛户淘汰，到最后，韩国牛肉价格将被国际金融炒家掌控！ 只有自己生产，才不会被别人所控制，就这么简单！ 我们今天大米价格为什么这么低，而国际价格是我们国内价格的四倍，因为是我们自己生产的。同理石油价格我们还可以抗一下,但我们扛不久，因为造成大量的浪费。","tags":[{"name":"经济学","slug":"经济学","permalink":"http://yoursite.com/tags/经济学/"}]},{"title":"《产业阴谋链：笔记二 产业阴谋链与二元经济的形成》","date":"2016-09-09T04:04:42.000Z","path":"2016/09/09/《产业阴谋链：笔记二-产业阴谋链与二元经济的形成》/","text":"我国超过一半的GDP都是固定资产投资，而欧美日本的固定资产投资只有我们的一半。固定资产投资就是读者到处可以看到的高架，桥梁，地铁，地产等等。这些过度的投资带动了经济的成长。所以我国经济就是一个畸形扭曲的“二元经济”，一方面是由于产业链定位错误苦苦挣扎的制造业，另外一方面是极其火爆以拉动GDP为主导的建设工程包括了钢铁，水泥，政绩工程，形象工程，大型国企，替他们融资的银行等等。 这种二元经济就是中国的特色，但是最近几年由于政府政策的错误，使得二元经济现象更加严峻。 第一个错误就是以拉动GDP为主导的经济发展政策，无疑的造成投资过多，而消费过少的局面,我们工厂生产出这么多的产品由于国内消费不足，只有出口卖给外国人消费，因而必定造成所谓“出口创汇”的现实情况，因此外汇迅速积累,大量外汇给了欧美各国极好的借口压迫人民币升值。 第二个错误就是劳动合同法的不当推出，劳动合同法本身它的意义是重大的，问题是这么重大的法案，竟然没有经过反复的讨论论证，更严重的是，没有经过任何的试点就全面的推出。第三个错误就是宏观调控的错误，政府看到了股市和地产的过热就持续加强了宏观调控的力度。前两年，深圳的房地产市场非常的火爆，那时候媒体都报道说，老百姓对我们经济发展更有信心了，深圳地区经济发展更成功了,本质上，深圳地区房地产之所以火爆是因为深圳的经济发展更衰退了！因为企业家更不想继续经营实业了，他们决定不投资了，而拿出来炒楼，如果中国企业过热，企业家的日子不会这么难过！如果你现在从事的恰好是制造业的话，那么你此刻所感受到的是不折不扣的萧条而不是过热。如果你因为不切身从事而还没感觉到，那么你可以去看看大量出口型企业现在的困境。","tags":[{"name":"经济学","slug":"经济学","permalink":"http://yoursite.com/tags/经济学/"}]},{"title":"《产业阴谋链：笔记一 一场没有硝烟的战争》","date":"2016-09-07T04:00:34.000Z","path":"2016/09/07/《产业阴谋链：笔记一-一场没有硝烟的战争》/","text":"中国是制造业大国吗？今天的国际竞争已经不是企业的竞争，已经不是产品的竞争，而是进入到了一个前所未有的，一个全新的产业链的战争市场。 1.产业链6+1我们的制造业工厂，对外拖欠原料和组件货款，对内延长劳动时间等等，真可谓不择手段，在最不赚钱的领域不停压榨！ 实际上，任何行业的产业链，除了加工制造，还有六大环节：产品设计，原料采购，物流运输，订单处理，批发经营，终端零售。正是这六大环节创造出了九美金的价值，不过在现在的全球竞争格局下，这些环节中最关键最赚钱的环节，几乎都不是我们中国企业所控制 那些没有觉醒的企业，大多数在国际分工之下，都被分到附加值最低的，浪费资源的，破坏环境的，不得不剥削劳动的——制造环节。而其他有价值的环节基本上全部掌控在欧美各国的手中。也就是说，当我们破坏环境、浪费资源、剥削劳动创造出一块钱血淋淋的产品之后，我们同时就替美国创造出九倍的价值。当我们创造出一万美元的价值之后，我们就同时替美国创造出九万美元的价值。因此中国越制造，美国越富裕。 2.从产业链分工看大学生就业困难。 产业链跟我们大学生就业难有什么关系。六加一的环节里面，真正需要大学生的是六而不是一。 今天的中国是一个什么样的产业结构，是一个以一为主而不是一个以六为主的产业结构。我国的产业现状不足以支持这么样的大学生比例，这就是大学生找工作难的原因。 产业链定位悲剧。今天中国企业所面临的问题，已经不是国企和民企哪个更有效率的问题，而是在这种国际产业链分工之下，如果国企和民企不能急起直追的话，有可能双双被淘汰，事情就是如此之严峻！","tags":[{"name":"经济学","slug":"经济学","permalink":"http://yoursite.com/tags/经济学/"}]},{"title":"那些屡试不爽的谈判技巧","date":"2016-09-05T15:10:57.000Z","path":"2016/09/05/那些屡试不爽的谈判技巧/","text":"1.第一招要藏锋芒，针针不见血，做好防守姿势，引诱对方步步紧逼，捕捉两种错误——事实错误（所谓硬伤）、逻辑错误。 在对方攻势渐缓时，以对方之前表述中的两种错误为「武器」，优雅地扔回去。只需几针，见血就收。 人和人打交道，尤其部分中国人，「面子」和「规矩」是个有趣的东西，当你挑出他的两种错误，摆出来晾晒，他会让步的，一定会！而随后的形势，会向你的方向逆转。 2.第二招纠结于细节，不如营造气势。对方的所有表述，可以不做任何表态，听着……只要能找到一、两个突破点，质疑、质问，然后全盘否定。 不需多言，对方自己会否定自己的一切表述，重新来过，甚至会主动让步，说瞎话被你识破，害臊了！其实他说了一百句，只有三句是瞎话，但被你揪住了。 2.第三招一针见血的分析方法缺乏普遍意义！而是要采用「全面的肤浅」策略，尝试诱导对方的思维路径。在交流中，发现对方的「痛点」，用你的相对优势与其匹配，告诉他，这个问题很关键，我们更善于解决这个问题。","tags":[{"name":"商业技巧","slug":"商业技巧","permalink":"http://yoursite.com/tags/商业技巧/"}]},{"title":"不信...如果...","date":"2016-09-03T12:40:31.000Z","path":"2016/09/03/不信-如果/","text":"我一直认为从古至今很多人的一生都被两个词所左右，一个词是“不信”，一个词是“如果”，有的人的一生平平庸庸无所作为因为他相信了前者忽视了后者，有的人的一生注定改变世界因为他坚信后者，坚信。 乔布斯想“如果”手机能做的再简单一点该有多好，于是有了 iphone 美得令人窒息的设计，莱特兄弟像“如果”人能够在天上飞该有多好，于是有了飞机。","tags":[]},{"title":"把批评当做一种信息对待","date":"2016-09-01T12:21:21.000Z","path":"2016/09/01/把批评当做一种信息对待/","text":"在精益创业中，拿出最小可行化产品还远远不够，这只是开始，之后的进程就是不断地获取反馈并在反馈中获得优化。如何处理外界的反馈也是一门艺术。 不喜欢听批评恐怕是人的一种天性。批评本身（很有可能）包含了有价值的信息，所以批评也可以理解为一种帮助。所以对待批评的合理态度是，把批评作为一种“信息”而不是一种“评价”来看待。当然“接收”并不等于“接受”，因为所有输入的信息都需要慎重的审视，只不过不要一开始就情绪化的加以排斥。很多时候，别人的批评并不正确，但思考和辨析这些批评本身对我们也是有益的。 本能的抗拒批评和经过深思熟虑之后反对批评是两回事，后者往往意味着更成熟的心智和更坚定的信念。 成熟心智的一个特点就是，他能不偏不倚的、公正的对待自己和他人的意见，即不固步自封也不附和盲从。","tags":[{"name":"心智","slug":"心智","permalink":"http://yoursite.com/tags/心智/"}]},{"title":"我们应该如何去反思？","date":"2016-08-30T12:15:36.000Z","path":"2016/08/30/我们应该如何去反思？/","text":"在做完一件事情之后,我们可以怎样去反思呢?至少可以从以下几个方面来进行: 1.信息:在做这件事时我利用了哪些信息?其中哪些信息是最关键的?这些信息是从哪些渠道中得来的?哪些渠道被证明是很有价值的?我可能遗漏了哪些信息?这些信息可以怎么得到? 2.预期:在做事之前,是否对事情的过程和结果形成了正确的预期?我为什么会形成这样的预期?是什么造成了预期和事实之间的偏差?我的预期是否促成或阻碍了事情的进程?今后应该如何管理自己的预期? 3.结果:怎样描述这件事情的结果?怎样评价这件事的结果?在描述和评价这件事的时候我用了哪些指标?这些指标是否需要改进?结果需要哪些改进?如何改进? 4.进度:事件的进度合适吗,是太快了还是太慢了?什么因素导致了这样的结果?当进度出现问题时使用了哪些手段进行干预?效果如何?为什么效果理想或者不理想? 5.工具:在完成这件事的过程中使用了哪些工具?哪些工具起到了重要的促进作用?那些工具起到了阻碍作用?如何改进现有的工具使其发挥更好的功效? 6.情绪:在做这件事的过程中我的情绪状态是怎样的?是否出现过情绪失控的情况?是什么引发的?我是否有意识的调整自己的情绪?在这期间使用了什么方法?是否需要改进? 7.阻碍:在做事个过程中我遇到了那些阻碍?其中重大的阻碍是什么?我是如何应对这些阻碍的?取得了什么效果?这些阻碍中那些会长期存在?我需要通过什么持续的努力来减少这些阻碍?8.优势:在做事的过程中我发挥了什么优势?是否有什么优势还没有利用和发挥的?在做事的过程中我的主要收获有哪些?我的哪些知识和能力得到了提升?我可以向做同类事情的其他人学习什么?他们有哪些优势是我不具备的? 9.缺憾:在做事的过程中我的遗憾有哪些?最大的遗憾是什么?是什么原因造成了这个遗憾?在做事的过程中我暴露了那些缺点?其中哪些缺点是必须且迫切需要改正的?关于这件事别人对我有什么批评和评价?他们的批评有哪些可取之处? 10.意义:这件事对我来说最大的意义是什么?对我的短期生活和长期生活分别有什么影响?这件事对周围人对社会的意义是什么?我发现了哪些意想不到的意义? 你可以从这些问题示范之中找出你所需要的,然后及时反思,及时梳理.","tags":[{"name":"心智","slug":"心智","permalink":"http://yoursite.com/tags/心智/"}]}]